zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/drivers/src/stm32h5xx_hal_play.c
/**
  ******************************************************************************
  * @file    stm32h5xx_hal_play.c
  * @brief   PLAY HAL module driver.
  *          This file provides firmware functions to manage the following
  *          functions of the Programmable Logic Array (PLAY) peripheral:
  *           + Initialization and de-initialization functions
  *           + Peripheral Configuration functions
  *           + Peripheral Operational functions
  *           + Peripheral State functions
  *           + Peripheral Access Control functions
  *           + IRQ handler management
  *
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  @verbatim
  ==============================================================================
                     ##### How to use this driver #####
  ==============================================================================
  [..]
    The PLAY HAL driver can be used as follows:

    (#) Declare a HAL_PLAY_HandleTypeDef handle structure, for example:
        HAL_PLAY_HandleTypeDef hplay;
    (#) Initialize the PLAY low-level resources by implementing the HAL_PLAY_MspInit() API:
        (##) Select the PLAY kernel clock source
        (##) Configure the PLAY kernel clock prescaler
        (##) Enable the PLAY interface clock
        (##) PLAY pins configuration:
            (+++) Enable the clock for the PLAY GPIOs
            (+++) Configure PLAY pins as alternate function
        (##) NVIC configuration if you need to use interrupt process:
            (+++) Configure the PLAY interrupt priority.
            (+++) Enable the NVIC PLAY IRQ.
        (##) Optionally, reset the peripheral either by a full reset of all registers or
             by an "application" reset for only the functional registers (refer to the RCC APIs)

    (#) Initialize PLAY registers by calling the HAL_PLAY_Init() API which calls HAL_PLAY_MspInit()

    (#) To configure PLAY, call the following APIs:
           - HAL_PLAY_INPUT_SetConfig() : to select the input signals and configure filters
           - HAL_PLAY_LUT_SetConfig() : to configure the Look-Up Tables (LUTs)
           - Finalize the configuration by calling the API HAL_PLAY_OUTPUT_SetConfig().
             This one allows to output some Look-Up Table Outputs and
             indicates that the peripheral is ready to start (handle state = @ref HAL_PLAY_STATE_READY).

    (#) After ending the configuration, start the PLAY with HAL_PLAY_Start() to:
          - Lock the PLAYx configuration registers to prevent any accidental write access.
            The kernel clock becomes operational: LUT registered outputs, filters, software triggers and edge triggers
            are functional.
          - Set a first configuration of edge trigger on LUT outputs.

        At this step, the PLAY Outputs can be connected to GPIOs or internal peripherals.

    (#) Stop the PLAY with the API HAL_PLAY_Stop().
        This function disables all Look-Up Table (LUT) output interrupts and unlocks the configuration.
        The handle state is back to @ref HAL_PLAY_STATE_READY and allows the Application to update the peripheral.

        Disconnect all peripherals connected to PLAY outputs before updating the configuration to avoid glitches.

    (#) At the end of the PLAY processor User application, call the function HAL_PLAY_DeInit() to restore the default
        configuration which calls HAL_PLAY_MspDeInit().

  *** Look-Up Table Output ***
  ============================
  [..]
    (+) The Truth Table of a Look-Up Table is composed of 16 combinations (with 4 inputs):
      Combination ID | IN3 | IN2 | IN1 | IN0 | OUT O(y)
      -------------- | --- | --- | --- | --- | --------
             0       |  0  |  0  |  0  |  0  |  O0
             1       |  0  |  0  |  0  |  1  |  O1
             2       |  0  |  0  |  1  |  0  |  O2
             3       |  0  |  0  |  1  |  1  |  O3
             4       |  0  |  1  |  0  |  0  |  O4
             5       |  0  |  1  |  0  |  1  |  O5
             6       |  0  |  1  |  1  |  0  |  O6
             7       |  0  |  1  |  1  |  1  |  O7
             8       |  1  |  0  |  0  |  0  |  O8
             9       |  1  |  0  |  0  |  1  |  O9
             10      |  1  |  0  |  1  |  0  |  O10
             11      |  1  |  0  |  1  |  1  |  O11
             12      |  1  |  1  |  0  |  0  |  O12
             13      |  1  |  1  |  0  |  1  |  O13
             14      |  1  |  1  |  1  |  0  |  O14
             15      |  1  |  1  |  1  |  1  |  O15
      An O(y) Output value is 0 or 1.
      The truth table value is calculated with this formula:

          (O0 * 2^0) + (O1 * 2^1) + (O2 * 2^2) + ... + ((O15 * 2^15))

      There are several Truth Table values for a logic gate depending on the selected inputs.
      For example the Truth Table values for the logic 'AND' are (non-exhaustive list):
        - for IN1 & IN0: 0x8888
        - for IN2 & IN1: 0xC0C0
        - for IN3 & IN2: 0xF000
        - for IN2, IN1 & IN0: 0x8080
        - for IN3, IN2, IN1 & IN0: 0x8000
        - ...
    (+) A Look-Up Table generates a single output which can be stored with a register.
        Each output has a flag which is triggered on a rising or falling edge (depending on the user configuration).

        The LUT output interrupts can be enabled to advise when an output state change using the
        HAL_PLAY_OUTPUT_EnableIT() function.
        When an interrupt is triggered, the callbacks HAL_PLAY_LUTOutputRisingCallback()
        or HAL_PLAY_LUTOutputFallingCallback() are called (depending on the edge trigger configuration).

