zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/drivers/src/stm32h5xx_hal_play.c
        In polling mode, HAL_PLAY_OUTPUT_PollForEdgeTrigger() can be used, but the LUT output might change in the time
        frame between the end of polling and the treatment to do for the related output.

  *** Callback registration ***
  =============================
  [..]
      The compilation define USE_HAL_PLAY_REGISTER_CALLBACKS, when set to 1, allows the user to configure
      dynamically the driver callbacks.

  [..]
      Use the function HAL_PLAY_RegisterCallback() to register a callback taking only the HAL peripheral handle
      as parameter.
      Use the function HAL_PLAY_RegisterLUTOutputCallback() to register a callback taking two parameters
      (handle + uint32_t) and which is dedicated to perform action when almost a LUT Output state changed.

      Both HAL_PLAY_RegisterCallback() and HAL_PLAY_RegisterLUTOutputCallback() take as parameters:
        - The HAL peripheral handle
        - The Callback ID
        - The pointer to the user callback function

  [..]
      Use function HAL_PLAY_UnRegisterCallback() and HAL_PLAY_UnRegisterLUTOutputCallback() to reset a callback
      to the default weak function.
      HAL_PLAY_UnRegisterCallback() and HAL_PLAY_UnRegisterLUTOutputCallback() takes as parameters the HAL peripheral
      handle and the Callback ID.

  [..]
      Use respectively, the functions HAL_PLAY_RegisterCallback() / HAL_PLAY_UnRegisterCallback() to register or
      unregister following callbacks:
        (+) MspInitCallback              : PLAY MspInit.
        (+) MspDeInitCallback            : PLAY MspDeInit.
        (+) SWTriggerWriteCpltCallback   : Software Trigger Write Complete callback.
        (+) EdgeTriggerWriteCpltCallback : Edge Trigger Write Complete callback.

  [..]
      Use respectively, the functions HAL_PLAY_RegisterLUTOutputCallback() / HAL_PLAY_UnRegisterLUTOutputCallback(),
      to register / unregister following callbacks:
        (+) HAL_PLAY_LUTOutputRisingCallback()  : Look-Up Table output rising edge triggered callback.
        (+) HAL_PLAY_LUTOutputFallingCallback() : Look-Up Table output falling edge triggered callback.

  [..]
      By default, after the HAL_PLAY_Init() and when the state is @ref HAL_PLAY_STATE_RESET, all callbacks are reset
      to the corresponding legacy weak functions.

      Exception done for MspInit and MspDeInit callbacks that are respectively reset to the legacy weak function in
      the HAL_PLAY_Init() and HAL_PLAY_DeInit() only when these callbacks are NULL (not registered beforehand).
      If not, MspInit or MspDeInit are not NULL, the HAL_PLAY_Init() and HAL_PLAY_DeInit() keep and use the user
      MspInit/MspDeInit callbacks (registered beforehand).

  [..]
      Callbacks can be registered/unregistered in @ref HAL_PLAY_STATE_INIT and @ref HAL_PLAY_STATE_READY states only.
      Exception done for MspInit/MspDeInit callbacks that can also be registered/unregistered in
      @ref HAL_PLAY_STATE_RESET state, thus registered (user) MspInit/DeInit callbacks can be used during
      the Init/DeInit.
      To do so, register the MspInit/MspDeInit user callbacks using HAL_PLAY_RegisterCallback() before calling
      HAL_PLAY_DeInit() or HAL_PLAY_Init() functions.

  [..]
      When the compilation define USE_HAL_PLAY_REGISTER_CALLBACKS is set to 0 or not defined, the callback registering
      feature is not available and all callbacks are set to the corresponding weak functions.

  @endverbatim
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32h5xx_hal.h"

/** @addtogroup STM32H5xx_HAL_Driver
  * @{
  */

/** @addtogroup PLAY
  * @{
  */

#ifdef HAL_PLAY_MODULE_ENABLED
#if defined(PLAY1)

/* Private types -------------------------------------------------------------*/
/* Private defines -----------------------------------------------------------*/
/** @defgroup PLAY_Private_Constants  PLAY Private Constants
  * @{
  */

/**
  * @brief Definitions used to decode the @ref HAL_PLAY_IN_SourceTypeDef enumerated values
  */
#define PLAY_INSTANCE_ID_MASK  (0x3UL << HAL_PLAY_INSTANCE_ID_POS) /*!< Instance ID field mask                 */
#define PLAY_IN_MUX_MASK       (0x1FUL << HAL_PLAY_IN_MUX_POS)     /*!< Input multiplexer field mask           */
#define PLAY_IN_MUX_VALUE_POS  (0U)                                /*!< Input multiplexer value field position */
#define PLAY_IN_MUX_VALUE_MASK (0xFUL << PLAY_IN_MUX_VALUE_POS)    /*!< Input multiplexer value field mask     */

/**
  * @brief PLAY Interrupt Definition
  */
#define PLAY_IT_STATUS_SW_TRIGGER_WRITE_COMPLETE   LL_PLAY_IER_SWINWC_IEN  /*!< Software trigger write complete interrupt */
#define PLAY_IT_STATUS_EDGE_TRIGGER_WRITE_COMPLETE LL_PLAY_IER_FLCTLWC_IEN /*!< Edge trigger write complete interrupt     */

/**
  * @brief Maximum Timeout for any write on Software Trigger or Edge Trigger register.
  *
  * With LSI as PLAY kernel clock source and a prescaler of 32768, the play_clk cycle is 1s.
  * A write takes 3 cycles of play_clk + 2 cycles of PCLK, then a write can take almost 3s.
  */
#define PLAY_WRITE_TIMEOUT_MS (4000U) /*!< Maximum Write Timeout for Software Trigger or Edge Trigger register: 4000 ms */

/**
  * @}
  */

/* Private macro -------------------------------------------------------------*/
/** @defgroup PLAY_Private_Macros  PLAY Private Macros
  * @{
  */

/**
  * @brief Retrieve the bit status in a given register.
  * @param  reg The register to check.
  * @param  bit The bit to check.
  * @retval 1   bit is set.
  * @retval 0   bit is reset.
  */
#define IS_PLAY_BIT_SET(reg, bit)  (((reg) & (bit)) == (bit))

/**
  * @brief Retrieve the PLAY hardware CMSIS instance from the hal handle.
  * @param handle specifies the peripheral handle.
  */
#define PLAY_GET_INSTANCE(handle)  ((handle)->instance)

/**
  * @brief Retrieve the PLAYx instance ID from the HAL handle.
  * @param handle Specifies the peripheral handle.
  */
#define PLAY_GET_INSTANCE_ID(handle)  \
  (HAL_PLAY1_INSTANCE_ID)

/**
  * @brief Verifies the PLAY privileged access level attribute.
  * @param  attribute Value of PLAY attribute.
  * @retval 1         attribute is a valid value.
  * @retval 0         attribute is an invalid value.
  */
#define IS_PLAY_ITEM_PRIV_ATTR(attribute) \
  (((attribute) == HAL_PLAY_NPRIV)        \
   || ((attribute) == HAL_PLAY_PRIV))

/**
  * @brief Verifies the PLAY privileged item value.
  * @param  item Value of PLAY privileged item.
  * @retval 1    item is a valid value.
  * @retval 0    item is an invalid value.
  */
#define IS_PLAY_PRIV_ITEM(item)              \
  (((item) == HAL_PLAY_PRIV_ITEM_CONFIG)     \
   || ((item) == HAL_PLAY_PRIV_ITEM_ALL))

/**
  * @brief Verifies the PLAY security access level attribute.
  * @param  attribute Value of PLAY attribute.
  * @retval 1         attribute is a valid value.
  * @retval 0         attribute is an invalid value.
  */
#define IS_PLAY_ITEM_SEC_ATTR(attribute) \
  (((attribute) == HAL_PLAY_NSEC)        \
   || ((attribute) == HAL_PLAY_SEC))

/**
  * @brief Verifies the PLAY security item value.
  * @param  item Value of PLAY security item.
  * @retval 1    item is a valid value.
  * @retval 0    item is an invalid value.
  */
#define IS_PLAY_SEC_ITEM(item)             \
  (((item) == HAL_PLAY_SEC_ITEM_CONFIG)    \
   || ((item) == HAL_PLAY_SEC_ITEM_ALL))

/**
  * @brief Verifies the minimum pulse width value.
  * @param  width Value of pulse width.
  * @retval 1     width is a valid value.
  * @retval 0     width is an invalid value.
  */
#define IS_PLAY_MIN_PULSE_WIDTH(width)  ((width) <= (LL_PLAY_INPUT_FILTER_WIDTH_VALUE_MAX))

/**
  * @brief Verifies the edge detection mode.
  * @param  mode Value of edge detection mode (@ref HAL_PLAY_EdgeDetectionModeTypeDef).
  * @retval 1    mode is a valid value.
  * @retval 0    mode is an invalid value.
  */
#define IS_PLAY_EDGE_DETECTION_MODE(mode)                 \
  (((mode) == HAL_PLAY_EDGE_DETECTION_BYPASSED)           \
   || ((mode) == HAL_PLAY_EDGE_DETECTION_RISING)          \
   || ((mode) == HAL_PLAY_EDGE_DETECTION_FALLING)         \
   || ((mode) == HAL_PLAY_EDGE_DETECTION_RISING_FALLING))

/**
  * @brief Verifies the input multiplexer.
  * @param  mux Input multiplexer (@ref HAL_PLAY_INTypeDef).
  * @retval 1   mux is a valid value.
  * @retval 0   mux is an invalid value.
  */
#define IS_PLAY_IN(mux)         \
  (((mux) == HAL_PLAY_IN0)      \
   || ((mux) == HAL_PLAY_IN1)   \
   || ((mux) == HAL_PLAY_IN2)   \
   || ((mux) == HAL_PLAY_IN3)   \
   || ((mux) == HAL_PLAY_IN4)   \
   || ((mux) == HAL_PLAY_IN5)   \
   || ((mux) == HAL_PLAY_IN6)   \
   || ((mux) == HAL_PLAY_IN7)   \
   || ((mux) == HAL_PLAY_IN8)   \
   || ((mux) == HAL_PLAY_IN9)   \
   || ((mux) == HAL_PLAY_IN10)  \
   || ((mux) == HAL_PLAY_IN11)  \
   || ((mux) == HAL_PLAY_IN12)  \
   || ((mux) == HAL_PLAY_IN13)  \
   || ((mux) == HAL_PLAY_IN14)  \
   || ((mux) == HAL_PLAY_IN15))

/**
  * @brief Verifies the value of input multiplexer source for PLAY1 instance.
  * @param  source Input signal (@ref HAL_PLAY_IN_SourceTypeDef).
  * @retval 1      source is a valid value.
  * @retval 0      source is an invalid value.
  */
#define IS_PLAY1_IN_SOURCE(source)                           \
  /* IO */                                                   \
  (((source) == HAL_PLAY1_IN_IN0_MUX0)                       \
   || ((source) == HAL_PLAY1_IN_IN1_MUX1)                    \
   || ((source) == HAL_PLAY1_IN_IN2_MUX2)                    \
   || ((source) == HAL_PLAY1_IN_IN3_MUX3)                    \
   || ((source) == HAL_PLAY1_IN_IN4_MUX4)                    \
   || ((source) == HAL_PLAY1_IN_IN5_MUX5)                    \
   || ((source) == HAL_PLAY1_IN_IN6_MUX6)                    \
   || ((source) == HAL_PLAY1_IN_IN7_MUX7)                    \
   || ((source) == HAL_PLAY1_IN_IN8_MUX8)                    \
   || ((source) == HAL_PLAY1_IN_IN9_MUX9)                    \
   || ((source) == HAL_PLAY1_IN_IN10_MUX10)                  \
   || ((source) == HAL_PLAY1_IN_IN11_MUX11)                  \
   || ((source) == HAL_PLAY1_IN_IN12_MUX12)                  \
   || ((source) == HAL_PLAY1_IN_IN13_MUX13)                  \
   || ((source) == HAL_PLAY1_IN_IN14_MUX14)                  \
   || ((source) == HAL_PLAY1_IN_IN15_MUX15)                  \
   /* ADC */                                                 \
   || ((source) == HAL_PLAY1_IN_ADC1_AWD1_MUX3)              \
   || ((source) == HAL_PLAY1_IN_ADC1_AWD1_MUX7)              \
   || ((source) == HAL_PLAY1_IN_ADC1_AWD1_MUX9)              \
   || ((source) == HAL_PLAY1_IN_ADC1_AWD1_MUX15)             \
   || ((source) == HAL_PLAY1_IN_ADC1_AWD2_MUX0)              \
   || ((source) == HAL_PLAY1_IN_ADC1_AWD2_MUX4)              \
   || ((source) == HAL_PLAY1_IN_ADC1_AWD2_MUX8)              \
   || ((source) == HAL_PLAY1_IN_ADC1_AWD2_MUX10)             \
   || ((source) == HAL_PLAY1_IN_ADC2_AWD1_MUX3)              \
   || ((source) == HAL_PLAY1_IN_ADC2_AWD1_MUX7)              \
   || ((source) == HAL_PLAY1_IN_ADC2_AWD1_MUX11)             \
   || ((source) == HAL_PLAY1_IN_ADC2_AWD2_MUX4)              \
   || ((source) == HAL_PLAY1_IN_ADC2_AWD2_MUX8)              \
   || ((source) == HAL_PLAY1_IN_ADC2_AWD2_MUX12)             \
   /* COMP */                                                \
   || ((source) == HAL_PLAY1_IN_COMP1_OUT_MUX1)              \
   || ((source) == HAL_PLAY1_IN_COMP1_OUT_MUX5)              \
   || ((source) == HAL_PLAY1_IN_COMP1_OUT_MUX7)              \
   || ((source) == HAL_PLAY1_IN_COMP1_OUT_MUX13)             \
   || ((source) == HAL_PLAY1_IN_COMP2_OUT_MUX1)              \
   || ((source) == HAL_PLAY1_IN_COMP2_OUT_MUX5)              \
   || ((source) == HAL_PLAY1_IN_COMP2_OUT_MUX9)              \
   /* EVENT_OUT */                                           \
   || ((source) == HAL_PLAY1_IN_EVENTOUT_MUX0)               \
   || ((source) == HAL_PLAY1_IN_EVENTOUT_MUX8)               \
   || ((source) == HAL_PLAY1_IN_EVENTOUT_MUX12)              \
   /* LOCKUP */                                              \
   || ((source) == HAL_PLAY1_IN_LOCKUP_MUX4)                 \
   || ((source) == HAL_PLAY1_IN_LOCKUP_MUX8)                 \
   || ((source) == HAL_PLAY1_IN_LOCKUP_MUX12)                \
   || ((source) == HAL_PLAY1_IN_LOCKUP_MUX14)                \
   /* LPTIM */                                               \
   || ((source) == HAL_PLAY1_IN_LPTIM1_CH1_MUX3)             \
   || ((source) == HAL_PLAY1_IN_LPTIM1_CH1_MUX5)             \
   || ((source) == HAL_PLAY1_IN_LPTIM1_CH1_MUX11)            \
   || ((source) == HAL_PLAY1_IN_LPTIM1_CH1_MUX15)            \
   || ((source) == HAL_PLAY1_IN_LPTIM1_CH2_MUX0)             \
   || ((source) == HAL_PLAY1_IN_LPTIM1_CH2_MUX4)             \
   || ((source) == HAL_PLAY1_IN_LPTIM1_CH2_MUX6)             \
   || ((source) == HAL_PLAY1_IN_LPTIM1_CH2_MUX12)            \
   || ((source) == HAL_PLAY1_IN_LPTIM2_CH1_MUX3)             \
   || ((source) == HAL_PLAY1_IN_LPTIM2_CH1_MUX7)             \
   || ((source) == HAL_PLAY1_IN_LPTIM2_CH1_MUX15)            \
   || ((source) == HAL_PLAY1_IN_LPTIM2_CH2_MUX0)             \
   || ((source) == HAL_PLAY1_IN_LPTIM2_CH2_MUX4)             \
   || ((source) == HAL_PLAY1_IN_LPTIM2_CH2_MUX8)             \
   /* MCO */                                                 \
   || ((source) == HAL_PLAY1_IN_RCC_MCO1_MUX2)               \
   || ((source) == HAL_PLAY1_IN_RCC_MCO1_MUX6)               \
   || ((source) == HAL_PLAY1_IN_RCC_MCO1_MUX8)               \
   || ((source) == HAL_PLAY1_IN_RCC_MCO1_MUX14)              \
   || ((source) == HAL_PLAY1_IN_RCC_MCO2_MUX2)               \
   || ((source) == HAL_PLAY1_IN_RCC_MCO2_MUX6)               \
   || ((source) == HAL_PLAY1_IN_RCC_MCO2_MUX10)              \
   /* NMI */                                                 \
   || ((source) == HAL_PLAY1_IN_NMI_MUX3)                    \
   || ((source) == HAL_PLAY1_IN_NMI_MUX7)                    \
   || ((source) == HAL_PLAY1_IN_NMI_MUX11)                   \
   || ((source) == HAL_PLAY1_IN_NMI_MUX13)                   \
   /* SPI */                                                 \
   || ((source) == HAL_PLAY1_IN_SPI1_MOSI_MUX0)              \
   || ((source) == HAL_PLAY1_IN_SPI1_MOSI_MUX6)              \
   || ((source) == HAL_PLAY1_IN_SPI1_MOSI_MUX10)             \
   || ((source) == HAL_PLAY1_IN_SPI1_MOSI_MUX14)             \
   || ((source) == HAL_PLAY1_IN_SPI1_NSS_MUX5)               \
   || ((source) == HAL_PLAY1_IN_SPI1_NSS_MUX9)               \
   || ((source) == HAL_PLAY1_IN_SPI1_NSS_MUX13)              \
   || ((source) == HAL_PLAY1_IN_SPI1_NSS_MUX15)              \
   || ((source) == HAL_PLAY1_IN_SPI1_SCLK_MUX1)              \
   || ((source) == HAL_PLAY1_IN_SPI1_SCLK_MUX7)              \
   || ((source) == HAL_PLAY1_IN_SPI1_SCLK_MUX11)             \
   || ((source) == HAL_PLAY1_IN_SPI1_SCLK_MUX15)             \
   || ((source) == HAL_PLAY1_IN_SPI2_MOSI_MUX2)              \
   || ((source) == HAL_PLAY1_IN_SPI2_MOSI_MUX10)             \
   || ((source) == HAL_PLAY1_IN_SPI2_MOSI_MUX14)             \
   || ((source) == HAL_PLAY1_IN_SPI2_NSS_MUX1)               \
   || ((source) == HAL_PLAY1_IN_SPI2_NSS_MUX9)               \
   || ((source) == HAL_PLAY1_IN_SPI2_NSS_MUX13)              \
   || ((source) == HAL_PLAY1_IN_SPI2_SCLK_MUX3)              \
   || ((source) == HAL_PLAY1_IN_SPI2_SCLK_MUX11)             \
   || ((source) == HAL_PLAY1_IN_SPI2_SCLK_MUX15)             \
   /* TIM */                                                 \
   || ((source) == HAL_PLAY1_IN_TIM2_OC3_MUX1)               \
   || ((source) == HAL_PLAY1_IN_TIM2_OC3_MUX3)               \
   || ((source) == HAL_PLAY1_IN_TIM2_OC3_MUX9)               \
   || ((source) == HAL_PLAY1_IN_TIM2_OC3_MUX13)              \
   || ((source) == HAL_PLAY1_IN_TIM2_OC4_MUX2)               \
   || ((source) == HAL_PLAY1_IN_TIM2_OC4_MUX4)               \
   || ((source) == HAL_PLAY1_IN_TIM2_OC4_MUX10)              \
   || ((source) == HAL_PLAY1_IN_TIM2_OC4_MUX14)              \
   || ((source) == HAL_PLAY1_IN_TIM2_TRGO_MUX0)              \
   || ((source) == HAL_PLAY1_IN_TIM2_TRGO_MUX2)              \
   || ((source) == HAL_PLAY1_IN_TIM2_TRGO_MUX8)              \
   || ((source) == HAL_PLAY1_IN_TIM2_TRGO_MUX12)             \
   || ((source) == HAL_PLAY1_IN_TIM3_OC3_MUX1)               \
   || ((source) == HAL_PLAY1_IN_TIM3_OC3_MUX5)               \
   || ((source) == HAL_PLAY1_IN_TIM3_OC3_MUX13)              \
   || ((source) == HAL_PLAY1_IN_TIM3_OC4_MUX2)               \
   || ((source) == HAL_PLAY1_IN_TIM3_OC4_MUX6)               \
   || ((source) == HAL_PLAY1_IN_TIM3_OC4_MUX14)              \
   || ((source) == HAL_PLAY1_IN_TIM3_TRGO_MUX0)              \
   || ((source) == HAL_PLAY1_IN_TIM3_TRGO_MUX4)              \
   || ((source) == HAL_PLAY1_IN_TIM3_TRGO_MUX12)             \
   /* USART */                                               \
   || ((source) == HAL_PLAY1_IN_USART1_CK_MUX2)              \
   || ((source) == HAL_PLAY1_IN_USART1_CK_MUX6)              \
   || ((source) == HAL_PLAY1_IN_USART1_CK_MUX10)             \
   || ((source) == HAL_PLAY1_IN_USART1_CK_MUX12)             \
   || ((source) == HAL_PLAY1_IN_USART1_TX_MUX1)              \
   || ((source) == HAL_PLAY1_IN_USART1_TX_MUX5)              \
   || ((source) == HAL_PLAY1_IN_USART1_TX_MUX9)              \
   || ((source) == HAL_PLAY1_IN_USART1_TX_MUX11)             \
   || ((source) == HAL_PLAY1_IN_USART2_CK_MUX6)              \
   || ((source) == HAL_PLAY1_IN_USART2_CK_MUX10)             \
   || ((source) == HAL_PLAY1_IN_USART2_CK_MUX14)             \
   || ((source) == HAL_PLAY1_IN_USART2_TX_MUX5)              \
   || ((source) == HAL_PLAY1_IN_USART2_TX_MUX9)              \
   || ((source) == HAL_PLAY1_IN_USART2_TX_MUX13))

/**
  * @brief Verifies the value of input multiplexer source.
  * @param  instance PLAYx instance (PLAY_TypeDef). (*)
  * @param  source   Input signal (@ref HAL_PLAY_IN_SourceTypeDef).
  * @retval 1        source is a valid value.
  * @retval 0        source is an invalid value.
  *
  *  (*) : available in stm32h5xxxx.h in cmsis device header file.
  */
#define IS_PLAY_IN_SOURCE(instance, source)                                              \
  ((((instance) == PLAY1_NS) || ((instance) == PLAY1_S)) && IS_PLAY1_IN_SOURCE((source)))

/**
  * @brief Verifies the Look-Up Table of PLAY1 instance.
  * @param  lut Look-Up Table (@ref HAL_PLAY_LUTTypeDef).
  * @retval 1   lut is a valid value.
  * @retval 0   lut is an invalid value.
  */
#define IS_PLAY1_LUT(lut)        \
  (((lut) == HAL_PLAY_LUT0)      \
   || ((lut) == HAL_PLAY_LUT1)   \
   || ((lut) == HAL_PLAY_LUT2)   \
   || ((lut) == HAL_PLAY_LUT3)   \
   || ((lut) == HAL_PLAY_LUT4)   \
   || ((lut) == HAL_PLAY_LUT5)   \
   || ((lut) == HAL_PLAY_LUT6)   \
   || ((lut) == HAL_PLAY_LUT7)   \
   || ((lut) == HAL_PLAY_LUT8)   \
   || ((lut) == HAL_PLAY_LUT9)   \
   || ((lut) == HAL_PLAY_LUT10)  \
   || ((lut) == HAL_PLAY_LUT11)  \
   || ((lut) == HAL_PLAY_LUT12)  \
   || ((lut) == HAL_PLAY_LUT13)  \
   || ((lut) == HAL_PLAY_LUT14)  \
   || ((lut) == HAL_PLAY_LUT15))

/**
  * @brief Verifies the Look-Up Table.
  * @param  instance PLAYx instance (PLAY_TypeDef). (*)
  * @param  lut      Look-Up Table (@ref HAL_PLAY_LUTTypeDef).
  * @retval 1        lut is a valid value.
  * @retval 0        lut is an invalid value.
  *
  *  (*) : available in stm32h5xxxx.h in cmsis device header file.
  */
#define IS_PLAY_LUT(instance, lut)                                            \
  ((((instance) == PLAY1_NS) || ((instance) == PLAY1_S)) && IS_PLAY1_LUT(lut))

/**
  * @brief Verifies the lookup table input.
  * @param  lut_input Lookup table input.
  * @retval 1         lut_input is a valid value.
  * @retval 0         lut_input is an invalid value.
  */
#define IS_PLAY_LUT_INPUT(lut_input)       \
  (((lut_input) == HAL_PLAY_LUT_INPUT0)    \
   || ((lut_input) == HAL_PLAY_LUT_INPUT1) \
   || ((lut_input) == HAL_PLAY_LUT_INPUT2) \
   || ((lut_input) == HAL_PLAY_LUT_INPUT3))

/**
  * @brief Verifies the "LUT registered output" input source of a look-up table for PLAY1 instance.
  * @param  input_source Input signal value (@ref HAL_PLAY_LUT_InputSourceTypeDef).
  * @retval 1            input_source is a valid value.
  * @retval 0            input_source is an invalid value.
  */
#define IS_PLAY1_LUT_INPUT_SOURCE_LUT_OUT_REGISTERED(input_source) \
  (((input_source) == HAL_PLAY_LUT_INPUT_LUT0_OUT_REGISTERED)      \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT1_OUT_REGISTERED)   \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT2_OUT_REGISTERED)   \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT3_OUT_REGISTERED)   \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT4_OUT_REGISTERED)   \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT5_OUT_REGISTERED)   \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT6_OUT_REGISTERED)   \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT7_OUT_REGISTERED)   \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT8_OUT_REGISTERED)   \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT9_OUT_REGISTERED)   \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT10_OUT_REGISTERED)  \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT11_OUT_REGISTERED)  \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT12_OUT_REGISTERED)  \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT13_OUT_REGISTERED)  \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT14_OUT_REGISTERED)  \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT15_OUT_REGISTERED))

/**
  * @brief Verifies the "Input Multiplexer" input source of a look-up table.
  * @param  input_source Input signal value (@ref HAL_PLAY_LUT_InputSourceTypeDef).
  * @retval 1            input_source is a valid value.
  * @retval 0            input_source is an invalid value.
  */
#define IS_PLAY_LUT_INPUT_SOURCE_FILTER(input_source)  \
  (((input_source) == HAL_PLAY_LUT_INPUT_FILTER0)      \
   || ((input_source) == HAL_PLAY_LUT_INPUT_FILTER1)   \
   || ((input_source) == HAL_PLAY_LUT_INPUT_FILTER2)   \
   || ((input_source) == HAL_PLAY_LUT_INPUT_FILTER3)   \
   || ((input_source) == HAL_PLAY_LUT_INPUT_FILTER4)   \
   || ((input_source) == HAL_PLAY_LUT_INPUT_FILTER5)   \
   || ((input_source) == HAL_PLAY_LUT_INPUT_FILTER6)   \
   || ((input_source) == HAL_PLAY_LUT_INPUT_FILTER7)   \
   || ((input_source) == HAL_PLAY_LUT_INPUT_FILTER8)   \
   || ((input_source) == HAL_PLAY_LUT_INPUT_FILTER9)   \
   || ((input_source) == HAL_PLAY_LUT_INPUT_FILTER10)  \
   || ((input_source) == HAL_PLAY_LUT_INPUT_FILTER11)  \
   || ((input_source) == HAL_PLAY_LUT_INPUT_FILTER12)  \
   || ((input_source) == HAL_PLAY_LUT_INPUT_FILTER13)  \
   || ((input_source) == HAL_PLAY_LUT_INPUT_FILTER14)  \
   || ((input_source) == HAL_PLAY_LUT_INPUT_FILTER15))

