zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/drivers/src/stm32h5xx_hal_play.c
/**
  * @brief Verifies the "SW Trigger" input source of a look-up table.
  * @param  input_source Input signal value (@ref HAL_PLAY_LUT_InputSourceTypeDef).
  * @retval 1            input_source is a valid value.
  * @retval 0            input_source is an invalid value.
  */
#define IS_PLAY_LUT_INPUT_SOURCE_SWTRIG(input_source)  \
  (((input_source) == HAL_PLAY_LUT_INPUT_SWTRIG0)      \
   || ((input_source) == HAL_PLAY_LUT_INPUT_SWTRIG1)   \
   || ((input_source) == HAL_PLAY_LUT_INPUT_SWTRIG2)   \
   || ((input_source) == HAL_PLAY_LUT_INPUT_SWTRIG3)   \
   || ((input_source) == HAL_PLAY_LUT_INPUT_SWTRIG4)   \
   || ((input_source) == HAL_PLAY_LUT_INPUT_SWTRIG5)   \
   || ((input_source) == HAL_PLAY_LUT_INPUT_SWTRIG6)   \
   || ((input_source) == HAL_PLAY_LUT_INPUT_SWTRIG7)   \
   || ((input_source) == HAL_PLAY_LUT_INPUT_SWTRIG8)   \
   || ((input_source) == HAL_PLAY_LUT_INPUT_SWTRIG9)   \
   || ((input_source) == HAL_PLAY_LUT_INPUT_SWTRIG10)  \
   || ((input_source) == HAL_PLAY_LUT_INPUT_SWTRIG11)  \
   || ((input_source) == HAL_PLAY_LUT_INPUT_SWTRIG12)  \
   || ((input_source) == HAL_PLAY_LUT_INPUT_SWTRIG13)  \
   || ((input_source) == HAL_PLAY_LUT_INPUT_SWTRIG14)  \
   || ((input_source) == HAL_PLAY_LUT_INPUT_SWTRIG15))

/**
  * @brief Verifies the "LUT direct output" input source of the Look-Up Table 0 for PLAY1 instance.
  * @param  input_source Input signal value (@ref HAL_PLAY_LUT_InputSourceTypeDef).
  * @retval 1            input_source is a valid value.
  * @retval 0            input_source is an invalid value.
  */
#define IS_PLAY1_LUT_INPUT_SOURCE_LUT0(input_source)      \
  (((input_source) == HAL_PLAY_LUT_INPUT_LUT0_OUT_DIRECT))

/**
  * @brief Verifies the "LUT direct output" input source of the Look-Up Table 1 for PLAY1 instance.
  * @param  input_source Input signal value (@ref HAL_PLAY_LUT_InputSourceTypeDef).
  * @retval 1            input_source is a valid value.
  * @retval 0            input_source is an invalid value.
  */
#define IS_PLAY1_LUT_INPUT_SOURCE_LUT1(input_source)           \
  (((input_source) == HAL_PLAY_LUT_INPUT_LUT0_OUT_DIRECT)      \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT1_OUT_DIRECT)   \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT4_OUT_DIRECT)   \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT8_OUT_DIRECT)   \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT12_OUT_DIRECT))

/**
  * @brief Verifies the "LUT direct output" input source of the Look-Up Table 2 for PLAY1 instance.
  * @param  input_source Input signal value (@ref HAL_PLAY_LUT_InputSourceTypeDef).
  * @retval 1            input_source is a valid value.
  * @retval 0            input_source is an invalid value.
  */
#define IS_PLAY1_LUT_INPUT_SOURCE_LUT2(input_source)           \
  (((input_source) == HAL_PLAY_LUT_INPUT_LUT0_OUT_DIRECT)      \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT1_OUT_DIRECT)   \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT2_OUT_DIRECT)   \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT4_OUT_DIRECT)   \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT5_OUT_DIRECT)   \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT8_OUT_DIRECT)   \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT9_OUT_DIRECT)   \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT12_OUT_DIRECT)  \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT13_OUT_DIRECT))

/**
  * @brief Verifies the "LUT direct output" input source of the Look-Up Table 3 for PLAY1 instance.
  * @param  input_source Input signal value (@ref HAL_PLAY_LUT_InputSourceTypeDef).
  * @retval 1            input_source is a valid value.
  * @retval 0            input_source is an invalid value.
  */
#define IS_PLAY1_LUT_INPUT_SOURCE_LUT3(input_source)           \
  (((input_source) == HAL_PLAY_LUT_INPUT_LUT0_OUT_DIRECT)      \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT1_OUT_DIRECT)   \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT2_OUT_DIRECT)   \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT3_OUT_DIRECT)   \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT4_OUT_DIRECT)   \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT5_OUT_DIRECT)   \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT6_OUT_DIRECT)   \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT8_OUT_DIRECT)   \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT9_OUT_DIRECT)   \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT10_OUT_DIRECT)  \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT12_OUT_DIRECT)  \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT13_OUT_DIRECT)  \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT14_OUT_DIRECT))

/**
  * @brief Verifies the "LUT direct output" input source of the Look-Up Table 4 for PLAY1 instance.
  * @param  input_source Input signal value (@ref HAL_PLAY_LUT_InputSourceTypeDef).
  * @retval 1            input_source is a valid value.
  * @retval 0            input_source is an invalid value.
  */
#define IS_PLAY1_LUT_INPUT_SOURCE_LUT4(input_source)      \
  (((input_source) == HAL_PLAY_LUT_INPUT_LUT4_OUT_DIRECT))

/**
  * @brief Verifies the "LUT direct output" input source of the Look-Up Table 5 for PLAY1 instance.
  * @param  input_source Input signal value (@ref HAL_PLAY_LUT_InputSourceTypeDef).
  * @retval 1            input_source is a valid value.
  * @retval 0            input_source is an invalid value.
  */
#define IS_PLAY1_LUT_INPUT_SOURCE_LUT5(input_source)           \
  (((input_source) == HAL_PLAY_LUT_INPUT_LUT0_OUT_DIRECT)      \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT4_OUT_DIRECT)   \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT5_OUT_DIRECT)   \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT8_OUT_DIRECT)   \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT12_OUT_DIRECT))

/**
  * @brief Verifies the "LUT direct output" input source of the Look-Up Table 6 for PLAY1 instance.
  * @param  input_source Input signal value (@ref HAL_PLAY_LUT_InputSourceTypeDef).
  * @retval 1            input_source is a valid value.
  * @retval 0            input_source is an invalid value.
  */
#define IS_PLAY1_LUT_INPUT_SOURCE_LUT6(input_source)           \
  (((input_source) == HAL_PLAY_LUT_INPUT_LUT0_OUT_DIRECT)      \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT1_OUT_DIRECT)   \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT4_OUT_DIRECT)   \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT5_OUT_DIRECT)   \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT6_OUT_DIRECT)   \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT8_OUT_DIRECT)   \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT9_OUT_DIRECT)   \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT12_OUT_DIRECT)  \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT13_OUT_DIRECT))

/**
  * @brief Verifies the "LUT direct output" input source of the Look-Up Table 7 for PLAY1 instance.
  * @param  input_source Input signal value (@ref HAL_PLAY_LUT_InputSourceTypeDef).
  * @retval 1            input_source is a valid value.
  * @retval 0            input_source is an invalid value.
  */
#define IS_PLAY1_LUT_INPUT_SOURCE_LUT7(input_source)           \
  (((input_source) == HAL_PLAY_LUT_INPUT_LUT0_OUT_DIRECT)      \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT1_OUT_DIRECT)   \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT2_OUT_DIRECT)   \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT4_OUT_DIRECT)   \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT5_OUT_DIRECT)   \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT6_OUT_DIRECT)   \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT7_OUT_DIRECT)   \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT8_OUT_DIRECT)   \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT9_OUT_DIRECT)   \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT10_OUT_DIRECT)  \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT12_OUT_DIRECT)  \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT13_OUT_DIRECT)  \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT14_OUT_DIRECT))

/**
  * @brief Verifies the "LUT direct output" input source of the Look-Up Table 8 for PLAY1 instance.
  * @param  input_source Input signal value (@ref HAL_PLAY_LUT_InputSourceTypeDef).
  * @retval 1            input_source is a valid value.
  * @retval 0            input_source is an invalid value.
  */
#define IS_PLAY1_LUT_INPUT_SOURCE_LUT8(input_source)      \
  (((input_source) == HAL_PLAY_LUT_INPUT_LUT8_OUT_DIRECT))

/**
  * @brief Verifies the "LUT direct output" input source of the Look-Up Table 9 for PLAY1 instance.
  * @param  input_source Input signal value (@ref HAL_PLAY_LUT_InputSourceTypeDef).
  * @retval 1            input_source is a valid value.
  * @retval 0            input_source is an invalid value.
  */
#define IS_PLAY1_LUT_INPUT_SOURCE_LUT9(input_source)           \
  (((input_source) == HAL_PLAY_LUT_INPUT_LUT0_OUT_DIRECT)      \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT4_OUT_DIRECT)   \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT8_OUT_DIRECT)   \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT9_OUT_DIRECT)   \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT12_OUT_DIRECT))

/**
  * @brief Verifies the "LUT direct output" input source of the Look-Up Table 10 for PLAY1 instance.
  * @param  input_source Input signal value (@ref HAL_PLAY_LUT_InputSourceTypeDef).
  * @retval 1            input_source is a valid value.
  * @retval 0            input_source is an invalid value.
  */
#define IS_PLAY1_LUT_INPUT_SOURCE_LUT10(input_source)          \
  (((input_source) == HAL_PLAY_LUT_INPUT_LUT0_OUT_DIRECT)      \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT1_OUT_DIRECT)   \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT4_OUT_DIRECT)   \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT5_OUT_DIRECT)   \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT8_OUT_DIRECT)   \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT9_OUT_DIRECT)   \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT10_OUT_DIRECT)  \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT12_OUT_DIRECT)  \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT13_OUT_DIRECT))

/**
  * @brief Verifies the "LUT direct output" input source of the Look-Up Table 11 for PLAY1 instance.
  * @param  input_source Input signal value (@ref HAL_PLAY_LUT_InputSourceTypeDef).
  * @retval 1            input_source is a valid value.
  * @retval 0            input_source is an invalid value.
  */
#define IS_PLAY1_LUT_INPUT_SOURCE_LUT11(input_source)          \
  (((input_source) == HAL_PLAY_LUT_INPUT_LUT0_OUT_DIRECT)      \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT1_OUT_DIRECT)   \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT2_OUT_DIRECT)   \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT4_OUT_DIRECT)   \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT5_OUT_DIRECT)   \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT6_OUT_DIRECT)   \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT8_OUT_DIRECT)   \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT9_OUT_DIRECT)   \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT10_OUT_DIRECT)  \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT11_OUT_DIRECT)  \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT12_OUT_DIRECT)  \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT13_OUT_DIRECT)  \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT14_OUT_DIRECT))

/**
  * @brief Verifies the "LUT direct output" input source of the Look-Up Table 12 for PLAY1 instance.
  * @param  input_source Input signal value (@ref HAL_PLAY_LUT_InputSourceTypeDef).
  * @retval 1            input_source is a valid value.
  * @retval 0            input_source is an invalid value.
  */
#define IS_PLAY1_LUT_INPUT_SOURCE_LUT12(input_source)      \
  (((input_source) == HAL_PLAY_LUT_INPUT_LUT12_OUT_DIRECT))

/**
  * @brief Verifies the "LUT direct output" input source of the Look-Up Table 13 for PLAY1 instance.
  * @param  input_source Input signal value (@ref HAL_PLAY_LUT_InputSourceTypeDef).
  * @retval 1            input_source is a valid value.
  * @retval 0            input_source is an invalid value.
  */
#define IS_PLAY1_LUT_INPUT_SOURCE_LUT13(input_source)          \
  (((input_source) == HAL_PLAY_LUT_INPUT_LUT0_OUT_DIRECT)      \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT4_OUT_DIRECT)   \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT8_OUT_DIRECT)   \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT12_OUT_DIRECT)  \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT13_OUT_DIRECT))

/**
  * @brief Verifies the "LUT direct output" input source of the Look-Up Table 14 for PLAY1 instance.
  * @param  input_source Input signal value (@ref HAL_PLAY_LUT_InputSourceTypeDef).
  * @retval 1            input_source is a valid value.
  * @retval 0            input_source is an invalid value.
  */
#define IS_PLAY1_LUT_INPUT_SOURCE_LUT14(input_source)          \
  (((input_source) == HAL_PLAY_LUT_INPUT_LUT0_OUT_DIRECT)      \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT1_OUT_DIRECT)   \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT4_OUT_DIRECT)   \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT5_OUT_DIRECT)   \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT8_OUT_DIRECT)   \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT9_OUT_DIRECT)   \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT12_OUT_DIRECT)  \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT13_OUT_DIRECT)  \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT14_OUT_DIRECT))

/**
  * @brief Verifies the "LUT direct output" input source of the Look-Up Table 15 for PLAY1 instance.
  * @param  input_source Input signal value (@ref HAL_PLAY_LUT_InputSourceTypeDef).
  * @retval 1            input_source is a valid value.
  * @retval 0            input_source is an invalid value.
  */
#define IS_PLAY1_LUT_INPUT_SOURCE_LUT15(input_source)          \
  (((input_source) == HAL_PLAY_LUT_INPUT_LUT0_OUT_DIRECT)      \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT1_OUT_DIRECT)   \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT2_OUT_DIRECT)   \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT4_OUT_DIRECT)   \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT5_OUT_DIRECT)   \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT6_OUT_DIRECT)   \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT8_OUT_DIRECT)   \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT9_OUT_DIRECT)   \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT10_OUT_DIRECT)  \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT12_OUT_DIRECT)  \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT13_OUT_DIRECT)  \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT14_OUT_DIRECT)  \
   || ((input_source) == HAL_PLAY_LUT_INPUT_LUT15_OUT_DIRECT))

/**
  * @brief Verifies the input source of a look-up table for PLAY1 instance.
  * @param  lut          Look-Up Table (@ref HAL_PLAY_LUTTypeDef).
  * @param  input_source Input signal value (@ref HAL_PLAY_LUT_InputSourceTypeDef).
  * @retval 1            input_source is a valid value.
  * @retval 0            input_source is an invalid value.
  */
#define IS_PLAY1_LUT_INPUT_SOURCE(lut, input_source)                                \
  ((IS_PLAY1_LUT_INPUT_SOURCE_LUT_OUT_REGISTERED(input_source))                     \
   || (IS_PLAY_LUT_INPUT_SOURCE_FILTER(input_source))                               \
   || (IS_PLAY_LUT_INPUT_SOURCE_SWTRIG(input_source))                               \
   || (((lut) == HAL_PLAY_LUT0) && IS_PLAY1_LUT_INPUT_SOURCE_LUT0(input_source))    \
   || (((lut) == HAL_PLAY_LUT1) && IS_PLAY1_LUT_INPUT_SOURCE_LUT1(input_source))    \
   || (((lut) == HAL_PLAY_LUT2) && IS_PLAY1_LUT_INPUT_SOURCE_LUT2(input_source))    \
   || (((lut) == HAL_PLAY_LUT3) && IS_PLAY1_LUT_INPUT_SOURCE_LUT3(input_source))    \
   || (((lut) == HAL_PLAY_LUT4) && IS_PLAY1_LUT_INPUT_SOURCE_LUT4(input_source))    \
   || (((lut) == HAL_PLAY_LUT5) && IS_PLAY1_LUT_INPUT_SOURCE_LUT5(input_source))    \
   || (((lut) == HAL_PLAY_LUT6) && IS_PLAY1_LUT_INPUT_SOURCE_LUT6(input_source))    \
   || (((lut) == HAL_PLAY_LUT7) && IS_PLAY1_LUT_INPUT_SOURCE_LUT7(input_source))    \
   || (((lut) == HAL_PLAY_LUT8) && IS_PLAY1_LUT_INPUT_SOURCE_LUT8(input_source))    \
   || (((lut) == HAL_PLAY_LUT9) && IS_PLAY1_LUT_INPUT_SOURCE_LUT9(input_source))    \
   || (((lut) == HAL_PLAY_LUT10) && IS_PLAY1_LUT_INPUT_SOURCE_LUT10(input_source))  \
   || (((lut) == HAL_PLAY_LUT11) && IS_PLAY1_LUT_INPUT_SOURCE_LUT11(input_source))  \
   || (((lut) == HAL_PLAY_LUT12) && IS_PLAY1_LUT_INPUT_SOURCE_LUT12(input_source))  \
   || (((lut) == HAL_PLAY_LUT13) && IS_PLAY1_LUT_INPUT_SOURCE_LUT13(input_source))  \
   || (((lut) == HAL_PLAY_LUT14) && IS_PLAY1_LUT_INPUT_SOURCE_LUT14(input_source))  \
   || (((lut) == HAL_PLAY_LUT15) && IS_PLAY1_LUT_INPUT_SOURCE_LUT15(input_source)))

/**
  * @brief Verifies the input source of a look-up table
  * @param  instance     PLAYx instance (PLAY_TypeDef). (*)
  * @param  lut          Look-Up Table (@ref HAL_PLAY_LUTTypeDef).
  * @param  input_source Value of input source (@ref HAL_PLAY_LUT_InputSourceTypeDef).
  * @retval 1            input_source is a valid value.
  * @retval 0            input_source is an invalid value.
  *
  *  (*) : available in stm32h5xxxx.h in cmsis device header file.
  */
#define IS_PLAY_LUT_INPUT_SOURCE(instance, lut, input_source)                                            \
  ((((instance) == PLAY1_NS) || ((instance) == PLAY1_S)) && IS_PLAY1_LUT_INPUT_SOURCE(lut, input_source))

/**
  * @brief Verifies the signal source as Clock Gate for PLAY1 instance.
  * @param  source Signal source (@ref HAL_PLAY_LUT_ClkGateSourceTypeDef).
  * @retval 1      source is a valid value.
  * @retval 0      source is an invalid value.
  */
#define IS_PLAY1_LUT_CLOCK_GATE_SOURCE(source)                 \
  (((source) == HAL_PLAY_LUT_CLK_GATE_OFF)                     \
   || ((source) == HAL_PLAY_LUT_CLK_GATE_ON)                   \
   || ((source) == HAL_PLAY_LUT_CLK_GATE_SW_ACK)               \
   || ((source) == HAL_PLAY_LUT_CLK_GATE_LUT0_OUT_REGISTERED)  \
   || ((source) == HAL_PLAY_LUT_CLK_GATE_LUT1_OUT_REGISTERED)  \
   || ((source) == HAL_PLAY_LUT_CLK_GATE_LUT2_OUT_REGISTERED)  \
   || ((source) == HAL_PLAY_LUT_CLK_GATE_LUT3_OUT_REGISTERED)  \
   || ((source) == HAL_PLAY_LUT_CLK_GATE_LUT4_OUT_REGISTERED)  \
   || ((source) == HAL_PLAY_LUT_CLK_GATE_LUT5_OUT_REGISTERED)  \
   || ((source) == HAL_PLAY_LUT_CLK_GATE_LUT6_OUT_REGISTERED)  \
   || ((source) == HAL_PLAY_LUT_CLK_GATE_LUT7_OUT_REGISTERED)  \
   || ((source) == HAL_PLAY_LUT_CLK_GATE_LUT8_OUT_REGISTERED)  \
   || ((source) == HAL_PLAY_LUT_CLK_GATE_LUT9_OUT_REGISTERED)  \
   || ((source) == HAL_PLAY_LUT_CLK_GATE_LUT10_OUT_REGISTERED) \
   || ((source) == HAL_PLAY_LUT_CLK_GATE_LUT11_OUT_REGISTERED) \
   || ((source) == HAL_PLAY_LUT_CLK_GATE_LUT12_OUT_REGISTERED) \
   || ((source) == HAL_PLAY_LUT_CLK_GATE_LUT13_OUT_REGISTERED) \
   || ((source) == HAL_PLAY_LUT_CLK_GATE_LUT14_OUT_REGISTERED) \
   || ((source) == HAL_PLAY_LUT_CLK_GATE_LUT15_OUT_REGISTERED) \
   || ((source) == HAL_PLAY_LUT_CLK_GATE_FILTER0)              \
   || ((source) == HAL_PLAY_LUT_CLK_GATE_FILTER1)              \
   || ((source) == HAL_PLAY_LUT_CLK_GATE_FILTER2)              \
   || ((source) == HAL_PLAY_LUT_CLK_GATE_FILTER3)              \
   || ((source) == HAL_PLAY_LUT_CLK_GATE_FILTER4)              \
   || ((source) == HAL_PLAY_LUT_CLK_GATE_FILTER5)              \
   || ((source) == HAL_PLAY_LUT_CLK_GATE_FILTER6)              \
   || ((source) == HAL_PLAY_LUT_CLK_GATE_FILTER7)              \
   || ((source) == HAL_PLAY_LUT_CLK_GATE_FILTER8)              \
   || ((source) == HAL_PLAY_LUT_CLK_GATE_FILTER9)              \
   || ((source) == HAL_PLAY_LUT_CLK_GATE_FILTER10)             \
   || ((source) == HAL_PLAY_LUT_CLK_GATE_FILTER11)             \
   || ((source) == HAL_PLAY_LUT_CLK_GATE_FILTER12)             \
   || ((source) == HAL_PLAY_LUT_CLK_GATE_FILTER13)             \
   || ((source) == HAL_PLAY_LUT_CLK_GATE_FILTER14)             \
   || ((source) == HAL_PLAY_LUT_CLK_GATE_FILTER15)             \
   || ((source) == HAL_PLAY_LUT_CLK_GATE_SWTRIG0)              \
   || ((source) == HAL_PLAY_LUT_CLK_GATE_SWTRIG1)              \
   || ((source) == HAL_PLAY_LUT_CLK_GATE_SWTRIG2)              \
   || ((source) == HAL_PLAY_LUT_CLK_GATE_SWTRIG3)              \
   || ((source) == HAL_PLAY_LUT_CLK_GATE_SWTRIG4)              \
   || ((source) == HAL_PLAY_LUT_CLK_GATE_SWTRIG5)              \
   || ((source) == HAL_PLAY_LUT_CLK_GATE_SWTRIG6)              \
   || ((source) == HAL_PLAY_LUT_CLK_GATE_SWTRIG7)              \
   || ((source) == HAL_PLAY_LUT_CLK_GATE_SWTRIG8)              \
   || ((source) == HAL_PLAY_LUT_CLK_GATE_SWTRIG9)              \
   || ((source) == HAL_PLAY_LUT_CLK_GATE_SWTRIG10)             \
   || ((source) == HAL_PLAY_LUT_CLK_GATE_SWTRIG11)             \
   || ((source) == HAL_PLAY_LUT_CLK_GATE_SWTRIG12)             \
   || ((source) == HAL_PLAY_LUT_CLK_GATE_SWTRIG13)             \
   || ((source) == HAL_PLAY_LUT_CLK_GATE_SWTRIG14)             \
   || ((source) == HAL_PLAY_LUT_CLK_GATE_SWTRIG15))

/**
  * @brief Verifies the Clock Gate value.
  * @param  instance PLAYx instance (PLAY_TypeDef). (*)
  * @param  source   Signal source for Clock Gate.
  * @retval 1        source is a valid value.
  * @retval 0        source is an invalid value.
  *
  *  (*): available in stm32h5xxxx.h in cmsis device header file.
  */
#define IS_PLAY_LUT_CLOCK_GATE_SOURCE(instance, source)                                            \
  ((((instance) == PLAY1_NS) || ((instance) == PLAY1_S)) && IS_PLAY1_LUT_CLOCK_GATE_SOURCE(source))

/**
  * @brief Verifies the lookup table value.
  * @param  lut   Value of lookup table.
  * @retval 1     lut is a valid value.
  * @retval 0     lut is an invalid value.
  */
#define IS_PLAY_LUT_TRUTH_TABLE_VALUE(lut)  ((lut) <= (HAL_PLAY_LUT_TRUTH_TABLE_VALUE_MAX))

/**
  * @brief Verifies the Output Multiplexer.
  * @param  mux Output Multiplexer (@ref HAL_PLAY_OUTTypeDef).
  * @retval 1   mux is a valid value.
  * @retval 0   mux is an invalid value.
  */
#define IS_PLAY_OUT(mux)         \
  (((mux) == HAL_PLAY_OUT0)      \
   || ((mux) == HAL_PLAY_OUT1)   \
   || ((mux) == HAL_PLAY_OUT2)   \
   || ((mux) == HAL_PLAY_OUT3)   \
   || ((mux) == HAL_PLAY_OUT4)   \
   || ((mux) == HAL_PLAY_OUT5)   \
   || ((mux) == HAL_PLAY_OUT6)   \
   || ((mux) == HAL_PLAY_OUT7)   \
   || ((mux) == HAL_PLAY_OUT8)   \
   || ((mux) == HAL_PLAY_OUT9)   \
   || ((mux) == HAL_PLAY_OUT10)  \
   || ((mux) == HAL_PLAY_OUT11)  \
   || ((mux) == HAL_PLAY_OUT12)  \
   || ((mux) == HAL_PLAY_OUT13)  \
   || ((mux) == HAL_PLAY_OUT14)  \
   || ((mux) == HAL_PLAY_OUT15))

