zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/drivers/src/stm32h5xx_hal_play.c
/**
  * @brief Verifies the Output Multiplexer source for PLAY1 instance.
  * @param  source Value of output source.
  * @retval 1      source is a valid value.
  * @retval 0      source is an invalid value.
  */
#define IS_PLAY1_OUT_SOURCE(source)                          \
  (((source) == (uint32_t)HAL_PLAY_LUT0_OUT_DIRECT)          \
   || ((source) == (uint32_t)HAL_PLAY_LUT1_OUT_DIRECT)       \
   || ((source) == (uint32_t)HAL_PLAY_LUT2_OUT_DIRECT)       \
   || ((source) == (uint32_t)HAL_PLAY_LUT3_OUT_DIRECT)       \
   || ((source) == (uint32_t)HAL_PLAY_LUT4_OUT_DIRECT)       \
   || ((source) == (uint32_t)HAL_PLAY_LUT5_OUT_DIRECT)       \
   || ((source) == (uint32_t)HAL_PLAY_LUT6_OUT_DIRECT)       \
   || ((source) == (uint32_t)HAL_PLAY_LUT7_OUT_DIRECT)       \
   || ((source) == (uint32_t)HAL_PLAY_LUT8_OUT_DIRECT)       \
   || ((source) == (uint32_t)HAL_PLAY_LUT9_OUT_DIRECT)       \
   || ((source) == (uint32_t)HAL_PLAY_LUT10_OUT_DIRECT)      \
   || ((source) == (uint32_t)HAL_PLAY_LUT11_OUT_DIRECT)      \
   || ((source) == (uint32_t)HAL_PLAY_LUT12_OUT_DIRECT)      \
   || ((source) == (uint32_t)HAL_PLAY_LUT13_OUT_DIRECT)      \
   || ((source) == (uint32_t)HAL_PLAY_LUT14_OUT_DIRECT)      \
   || ((source) == (uint32_t)HAL_PLAY_LUT15_OUT_DIRECT)      \
   || ((source) == (uint32_t)HAL_PLAY_LUT0_OUT_REGISTERED)   \
   || ((source) == (uint32_t)HAL_PLAY_LUT1_OUT_REGISTERED)   \
   || ((source) == (uint32_t)HAL_PLAY_LUT2_OUT_REGISTERED)   \
   || ((source) == (uint32_t)HAL_PLAY_LUT3_OUT_REGISTERED)   \
   || ((source) == (uint32_t)HAL_PLAY_LUT4_OUT_REGISTERED)   \
   || ((source) == (uint32_t)HAL_PLAY_LUT5_OUT_REGISTERED)   \
   || ((source) == (uint32_t)HAL_PLAY_LUT6_OUT_REGISTERED)   \
   || ((source) == (uint32_t)HAL_PLAY_LUT7_OUT_REGISTERED)   \
   || ((source) == (uint32_t)HAL_PLAY_LUT8_OUT_REGISTERED)   \
   || ((source) == (uint32_t)HAL_PLAY_LUT9_OUT_REGISTERED)   \
   || ((source) == (uint32_t)HAL_PLAY_LUT10_OUT_REGISTERED)  \
   || ((source) == (uint32_t)HAL_PLAY_LUT11_OUT_REGISTERED)  \
   || ((source) == (uint32_t)HAL_PLAY_LUT12_OUT_REGISTERED)  \
   || ((source) == (uint32_t)HAL_PLAY_LUT13_OUT_REGISTERED)  \
   || ((source) == (uint32_t)HAL_PLAY_LUT14_OUT_REGISTERED)  \
   || ((source) == (uint32_t)HAL_PLAY_LUT15_OUT_REGISTERED))

/**
  * @brief Verifies the Output Multiplexer source.
  * @param  instance PLAYx instance (PLAY_TypeDef). (*)
  * @param  source   Value of output source.
  * @retval 1        source is a valid value.
  * @retval 0        source is an invalid value.
  *
  *  (*) : available in stm32h5xxxx.h in cmsis device header file.
  */
#define IS_PLAY_OUT_SOURCE(instance, source)                                            \
  ((((instance) == PLAY1_NS) || ((instance) == PLAY1_S)) && IS_PLAY1_OUT_SOURCE(source))

/**
  * @brief Verifies the polling mode.
  * @param  mode Value of mode (@ref HAL_PLAY_EdgeDetectionModeTypeDef).
  * @retval 1    mode is a valid value.
  * @retval 0    mode is an invalid value.
  */
#define IS_PLAY_POLL_MODE(mode)                  \
  (((mode) == HAL_PLAY_POLLING_FOR_ALL_EDGES)    \
   || ((mode) == HAL_PLAY_POLLING_FOR_ANY_EDGE))

/**
  * @brief Verifies the Software Trigger state value.
  * @param  state Value of state (@ref HAL_PLAY_SWTriggerStateTypeDef).
  * @retval 1     state is a valid value.
  * @retval 0     state is an invalid value.
  */
#define IS_PLAY_SWTRIGGER_STATE(state)      \
  (((state) == HAL_PLAY_SW_TRIGGER_RESET)   \
   || ((state) == HAL_PLAY_SW_TRIGGER_SET))

/**
  * @brief Verifies the Software Trigger.
  * @param  swtrig Software Trigger.
  * @retval 1      swtrig is a valid value.
  * @retval 0      swtrig is an invalid value.
  */
#define IS_PLAY_SWTRIGGER(swtrig)      \
  (((swtrig) == HAL_PLAY_SWTRIG0)      \
   || ((swtrig) == HAL_PLAY_SWTRIG1)   \
   || ((swtrig) == HAL_PLAY_SWTRIG2)   \
   || ((swtrig) == HAL_PLAY_SWTRIG3)   \
   || ((swtrig) == HAL_PLAY_SWTRIG4)   \
   || ((swtrig) == HAL_PLAY_SWTRIG5)   \
   || ((swtrig) == HAL_PLAY_SWTRIG6)   \
   || ((swtrig) == HAL_PLAY_SWTRIG7)   \
   || ((swtrig) == HAL_PLAY_SWTRIG8)   \
   || ((swtrig) == HAL_PLAY_SWTRIG9)   \
   || ((swtrig) == HAL_PLAY_SWTRIG10)  \
   || ((swtrig) == HAL_PLAY_SWTRIG11)  \
   || ((swtrig) == HAL_PLAY_SWTRIG12)  \
   || ((swtrig) == HAL_PLAY_SWTRIG13)  \
   || ((swtrig) == HAL_PLAY_SWTRIG14)  \
   || ((swtrig) == HAL_PLAY_SWTRIG15))

/**
  * @brief Verifies the Software Trigger mask.
  * @param  swtrig_msk Software Trigger mask.
  * @retval 1      swtrig is a valid value.
  * @retval 0      swtrig is an invalid value.
  */
#define IS_PLAY_SWTRIGGER_MSK(swtrig_msk) \
  ((((uint32_t)(swtrig_msk) & HAL_PLAY_SWTRIG_ALL) != 0x00U)      \
   && (((uint32_t)(swtrig_msk) & ~HAL_PLAY_SWTRIG_ALL) == 0x00U))

/**
  * @}
  */

/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
/** @defgroup PLAY_Private_Functions  PLAY Private Functions
  * @{
  */

static HAL_StatusTypeDef PLAY_LUT_SetEdgeTrigger(const HAL_PLAY_HandleTypeDef *hplay,
                                                 const HAL_PLAY_EdgeTriggerConfTypeDef *p_config,
                                                 uint32_t timeout_ms);

/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/
/** @addtogroup PLAY_Exported_Functions
  * @{
  */

/** @addtogroup PLAY_Exported_Functions_Group1
  * @{
A set of functions allowing to initialize and deinitialize the PLAYx peripheral:
 - HAL_PLAY_Init()      Initialize the selected device with the PLAY instance.
 - HAL_PLAY_DeInit()    De-initialize the selected PLAYx peripheral and reset the handle and status flags.
 - HAL_PLAY_MSPInit()   Initialize the PLAY MSP (MCU Specific Package).
 - HAL_PLAY_MSPDeInit() De-initialize the PLAY MSP.
  */

/**
  * @brief  Initialize the PLAY according to the associated handle.
  * @param  hplay Pointer to a @ref HAL_PLAY_HandleTypeDef.
  * @retval HAL_OK    PLAY instance has been correctly initialized.
  * @retval HAL_ERROR Invalid parameter.
  */
HAL_StatusTypeDef HAL_PLAY_Init(HAL_PLAY_HandleTypeDef *hplay)
{
  /* Check the parameters */
  if (hplay == NULL)
  {
    return HAL_ERROR;
  }

  assert_param(IS_PLAY_ALL_INSTANCE(PLAY_GET_INSTANCE(hplay)));

  /* Initialize the peripheral */
  if (hplay->State == HAL_PLAY_STATE_RESET)
  {
#if (USE_HAL_PLAY_REGISTER_CALLBACKS == 1)
    /* Register the default callback functions */
    hplay->SWTriggerWriteCpltCallback   = HAL_PLAY_SWTriggerWriteCpltCallback;
    hplay->EdgeTriggerWriteCpltCallback = HAL_PLAY_EdgeTriggerWriteCpltCallback;
    hplay->LUTOutputRisingCallback      = HAL_PLAY_LUTOutputRisingCallback;
    hplay->LUTOutputFallingCallback     = HAL_PLAY_LUTOutputFallingCallback;

