zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/drivers/src/stm32h5xx_hal_play.c
    if (hplay->MspInitCallback == NULL)
    {
      hplay->MspInitCallback = HAL_PLAY_MspInit;
    }

    /* Initialize the low-level hardware */
    hplay->MspInitCallback(hplay);
#else
    /* Initialize the low-level hardware */
    HAL_PLAY_MspInit(hplay);
#endif /* USE_HAL_PLAY_REGISTER_CALLBACKS */
  }

  /* Reset error code */
  hplay->ErrorCode = HAL_PLAY_ERROR_NONE;

  hplay->State = HAL_PLAY_STATE_INIT;

  return HAL_OK;
}

/**
  * @brief DeInitialize the PLAY peripheral.
  * @param hplay Pointer to a @ref HAL_PLAY_HandleTypeDef.
  * @note  HAL_PLAY_DeInit() does not reset all PLAY registers.
  *        The Application must call RCC API to force the reset of all PLAY registers.
  * @retval HAL_OK     Operation completed successfully.
  * @retval HAL_ERROR  Invalid parameter.
  */
HAL_StatusTypeDef HAL_PLAY_DeInit(HAL_PLAY_HandleTypeDef *hplay)
{
  PLAY_TypeDef *p_playx;

  /* Check the parameters */
  if (hplay == NULL)
  {
    return HAL_ERROR;
  }

  p_playx = PLAY_GET_INSTANCE(hplay);

  assert_param(IS_PLAY_ALL_INSTANCE(p_playx));

  /* Clear only interrupts & flags. The rest of configuration must be reset by the application with MspDeInit */
  LL_PLAY_LUT_DisableIT(p_playx, LL_PLAY_LUT_ALL_OUT_REGISTERED | LL_PLAY_LUT_ALL_OUT_DIRECT);
  LL_PLAY_LUT_DisableIT_EdgeTriggerWriteComplete(p_playx);
  LL_PLAY_LUT_ClearFlag(p_playx, LL_PLAY_LUT_ALL_OUT_REGISTERED | LL_PLAY_LUT_ALL_OUT_DIRECT);
  LL_PLAY_LUT_ClearFlag_EdgeTriggerWriteComplete(p_playx);
  LL_PLAY_DisableIT_SWTriggerWriteComplete(p_playx);
  LL_PLAY_ClearFlag_SWTriggerWriteComplete(p_playx);

  LL_PLAY_Unlock(p_playx);

#if (USE_HAL_PLAY_REGISTER_CALLBACKS == 1)
  if (hplay->MspDeInitCallback == NULL)
  {
    /* MspDeInit callback not set; reset to default HAL_PLAY_MspDeInit */
    hplay->MspDeInitCallback = HAL_PLAY_MspDeInit;
  }

  /* DeInitialize the low-level hardware */
  hplay->MspDeInitCallback(hplay);
#else
  /* DeInitialize the low-level hardware */
  HAL_PLAY_MspDeInit(hplay);
#endif /* USE_HAL_PLAY_REGISTER_CALLBACKS == 1 */

  /* Reset error code */
  hplay->ErrorCode = HAL_PLAY_ERROR_NONE;

  hplay->State = HAL_PLAY_STATE_RESET;

  return HAL_OK;
}

/**
  * @brief   Initialize the PLAY MSP.
  * @param   hplay Pointer to a @ref HAL_PLAY_HandleTypeDef.
  * @warning This weak function must not be modified. When the callback is needed,
  *          it must be implemented in the user file.
  */
__weak void HAL_PLAY_MspInit(HAL_PLAY_HandleTypeDef *hplay)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hplay);

  /* WARNING: This function must not be modified, when the callback is needed,
              function HAL_PLAY_MspInit() must be implemented in the user file.
   */
}

/**
  * @brief   DeInitialize the PLAY MSP.
  * @param   hplay Pointer to a @ref HAL_PLAY_HandleTypeDef.
  * @warning This weak function must not be modified. When the callback is needed,
  *          it must be implemented in the user file.
  */
__weak void HAL_PLAY_MspDeInit(HAL_PLAY_HandleTypeDef *hplay)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hplay);

  /* WARNING: This function must not be modified, when the callback is needed,
              function HAL_PLAY_MspDeInit() must be implemented in the user file.
   */
}

/**
  * @}
  */

/** @addtogroup PLAY_Exported_Functions_Group2
  * @{
A set of functions allowing to configure the PLAYx peripheral:

- Global configuration:
  - HAL_PLAY_INPUT_SetConfig()
  - HAL_PLAY_INPUT_GetConfig()
  - HAL_PLAY_LUT_SetConfig()
  - HAL_PLAY_LUT_GetConfig()
  - HAL_PLAY_OUTPUT_SetConfig()
  - HAL_PLAY_OUTPUT_GetConfig()

- Unitary configuration:
  - HAL_PLAY_INPUT_SetSource()
  - HAL_PLAY_INPUT_GetSource()
  - HAL_PLAY_INPUT_SetMinPulseWidth()
  - HAL_PLAY_INPUT_GetMinPulseWidth()
  - HAL_PLAY_INPUT_SetEdgeDetectionMode()
  - HAL_PLAY_INPUT_GetEdgeDetectionMode()
  - HAL_PLAY_LUT_SetTruthTable()
  - HAL_PLAY_LUT_GetTruthTable()
  - HAL_PLAY_LUT_SetSource()
  - HAL_PLAY_LUT_GetSource()
  - HAL_PLAY_LUT_SetClockGateSource()
  - HAL_PLAY_LUT_GetClockGateSource()
  - HAL_PLAY_OUTPUT_SetSource()
  - HAL_PLAY_OUTPUT_GetSource()
  */

/* PLAY Configuration functions ***********************************************/
/**
  * @brief  Configure multiple input multiplexers for the PLAY peripheral.
  * @param  hplay      Pointer to a @ref HAL_PLAY_HandleTypeDef.
  * @param  p_config   Pointer to an array of @ref HAL_PLAY_IN_ConfTypeDef.
  * @param  array_size Number of configurations in the array.
  * @retval HAL_OK     Operation completed successfully.
  * @retval HAL_ERROR  Invalid parameter or wrong state.
  */
HAL_StatusTypeDef HAL_PLAY_INPUT_SetConfig(HAL_PLAY_HandleTypeDef *hplay, const HAL_PLAY_IN_ConfTypeDef *p_config,
                                           uint32_t array_size)
{
  PLAY_TypeDef *p_playx;
  HAL_PLAY_StateTypeDef tmp_state;
  uint32_t is_locked;

  /* Check the parameters */
  if (hplay == NULL)
  {
    return HAL_ERROR;
  }

  p_playx = PLAY_GET_INSTANCE(hplay);

  if ((p_config == NULL) || (array_size > PLAY_INPUT_MUX_NBR(p_playx)))
  {
    hplay->ErrorCode |= HAL_PLAY_ERROR_INVALID_PARAM;

    return HAL_ERROR;
  }

  assert_param(((array_size > 0U) && (array_size <= PLAY_INPUT_MUX_NBR(p_playx))));

  /* Check the peripheral state */
  tmp_state = hplay->State;
  if ((tmp_state != HAL_PLAY_STATE_INIT) && (tmp_state != HAL_PLAY_STATE_READY))
  {
    return HAL_ERROR;
  }

  /* Unlock the configuration if not already done */
  is_locked = LL_PLAY_IsLocked(p_playx);
  if (is_locked != 0U)
  {
    LL_PLAY_Unlock(p_playx);
  }

  /* Write the configurations */
  for (uint32_t idx = 0; idx < array_size; idx++)
  {
    assert_param(IS_PLAY_MIN_PULSE_WIDTH(p_config[idx].min_pulse_width));
    assert_param(IS_PLAY_EDGE_DETECTION_MODE(p_config[idx].mode));
    assert_param(IS_PLAY_IN_SOURCE(p_playx, p_config[idx].source));

    uint32_t premuxsel_value =
      ((uint32_t)p_config[idx].source & PLAY_IN_MUX_VALUE_MASK) >> PLAY_IN_MUX_VALUE_POS;
    uint32_t input_mux = ((uint32_t)p_config[idx].source & PLAY_IN_MUX_MASK) >> HAL_PLAY_IN_MUX_POS;

