zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/drivers/src/stm32h5xx_hal_play.c
    LL_PLAY_INPUT_Config(p_playx, input_mux, premuxsel_value,
                         (uint32_t)p_config[idx].mode, p_config[idx].min_pulse_width);
  }

  return HAL_OK;
}

/**
  * @brief Retrieve the input multiplexer configurations of the PLAY peripheral in order from 0 to (array_size - 1),
  *        where array_size specifies the number of configurations.
  * @param  hplay      Pointer to a @ref HAL_PLAY_HandleTypeDef.
  * @param  p_config   Pointer to an array of @ref HAL_PLAY_IN_ConfTypeDef to be filled.
  * @param  array_size Number of configurations in the array.
  * @retval HAL_OK     Operation completed successfully.
  * @retval HAL_ERROR  Invalid parameter.
  */
HAL_StatusTypeDef HAL_PLAY_INPUT_GetConfig(HAL_PLAY_HandleTypeDef *hplay, HAL_PLAY_IN_ConfTypeDef *p_config,
                                           uint32_t array_size)
{
  const PLAY_TypeDef *p_playx;

  /* Check the parameters */
  if (hplay == NULL)
  {
    return HAL_ERROR;
  }

  p_playx = PLAY_GET_INSTANCE(hplay);

  if ((p_config == NULL) || (array_size > PLAY_INPUT_MUX_NBR(p_playx)))
  {
    hplay->ErrorCode = HAL_PLAY_ERROR_INVALID_PARAM;

    return HAL_ERROR;
  }

  assert_param(((array_size > 0U) && (array_size <= PLAY_INPUT_MUX_NBR(p_playx))));

  /* Rebuild the input source signal */
  uint32_t instance_id = (uint32_t)PLAY_GET_INSTANCE_ID(hplay);
  for (uint32_t idx = 0; idx < array_size; idx++)
  {
    uint32_t mux_sel = (uint32_t)idx << HAL_PLAY_IN_MUX_POS;
    uint32_t source = LL_PLAY_INPUT_GetSource(p_playx, (uint32_t)idx);

    uint32_t in_source = (instance_id | mux_sel | source);

    p_config[idx].source = (HAL_PLAY_IN_SourceTypeDef)in_source;
    p_config[idx].min_pulse_width = LL_PLAY_INPUT_GetMinimumPulseWidth(p_playx, idx);
    p_config[idx].mode = (HAL_PLAY_EdgeDetectionModeTypeDef)LL_PLAY_INPUT_GetEdgeDetectionMode(p_playx, idx);
  }

  return HAL_OK;
}

/**
  * @brief  Configure multiple lookup tables for the PLAY peripheral.
  * @param  hplay     Pointer to a @ref HAL_PLAY_HandleTypeDef.
  * @param  p_config  Pointer to an array of HAL_PLAY_LUT_ConfTypeDef.
  * @param  array_size Number of configurations in the array.
  * @retval HAL_OK     Operation completed successfully.
  * @retval HAL_ERROR  Invalid parameter or wrong state.
  */
HAL_StatusTypeDef HAL_PLAY_LUT_SetConfig(HAL_PLAY_HandleTypeDef *hplay, const HAL_PLAY_LUT_ConfTypeDef *p_config,
                                         uint32_t array_size)
{
  PLAY_TypeDef *p_playx;
  HAL_PLAY_StateTypeDef tmp_state;
  uint32_t is_locked;

  /* Check the parameters */
  if (hplay == NULL)
  {
    return HAL_ERROR;
  }

  p_playx = PLAY_GET_INSTANCE(hplay);

  if ((p_config == NULL) || (array_size > PLAY_INPUT_MUX_NBR(p_playx)))
  {
    hplay->ErrorCode |= HAL_PLAY_ERROR_INVALID_PARAM;

    return HAL_ERROR;
  }

  assert_param(((array_size > 0UL) && (array_size <= PLAY_LUT_NBR(p_playx))));

  /* Check the peripheral state */
  tmp_state = hplay->State;
  if ((tmp_state != HAL_PLAY_STATE_INIT) && (tmp_state != HAL_PLAY_STATE_READY))
  {
    return HAL_ERROR;
  }

  /* Unlock the configuration if not already done */
  is_locked = LL_PLAY_IsLocked(p_playx);
  if (is_locked != 0U)
  {
    LL_PLAY_Unlock(p_playx);
  }

  for (uint32_t idx = 0; idx < array_size; idx++)
  {
    assert_param(IS_PLAY_LUT(p_playx, p_config[idx].lut));
    assert_param(IS_PLAY_LUT_TRUTH_TABLE_VALUE(p_config[idx].truth_table));
    assert_param(IS_PLAY_LUT_INPUT_SOURCE(p_playx, p_config[idx].lut,
                                          p_config[idx].input_source[LL_PLAY_LUT_INPUT0]));
    assert_param(IS_PLAY_LUT_INPUT_SOURCE(p_playx, p_config[idx].lut,
                                          p_config[idx].input_source[LL_PLAY_LUT_INPUT1]));
    assert_param(IS_PLAY_LUT_INPUT_SOURCE(p_playx, p_config[idx].lut,
                                          p_config[idx].input_source[LL_PLAY_LUT_INPUT2]));
    assert_param(IS_PLAY_LUT_INPUT_SOURCE(p_playx, p_config[idx].lut,
                                          p_config[idx].input_source[LL_PLAY_LUT_INPUT3]));
    assert_param(IS_PLAY_LUT_CLOCK_GATE_SOURCE(p_playx, p_config[idx].clk_gate_source));

    LL_PLAY_LUT_SetTruthTable(p_playx, (uint32_t)p_config[idx].lut, p_config[idx].truth_table);
    LL_PLAY_LUT_ConfigInputs(p_playx, (uint32_t)p_config[idx].lut,
                             (uint32_t)p_config[idx].input_source[LL_PLAY_LUT_INPUT0],
                             (uint32_t)p_config[idx].input_source[LL_PLAY_LUT_INPUT1],
                             (uint32_t)p_config[idx].input_source[LL_PLAY_LUT_INPUT2],
                             (uint32_t)p_config[idx].input_source[LL_PLAY_LUT_INPUT3],
                             (uint32_t)p_config[idx].clk_gate_source);
  }

  return HAL_OK;
}

/**
  * @brief Retrieve the lookup table configurations of the PLAY peripheral in order from 0 to (array_size - 1),
  *        where array_size specifies the number of configurations.
  * @param  hplay      Pointer to a @ref HAL_PLAY_HandleTypeDef.
  * @param  p_config   Pointer to an array of @ref HAL_PLAY_LUT_ConfTypeDef.
  * @param  array_size Number of configurations in the array.
  * @retval HAL_OK     Operation completed successfully.
  * @retval HAL_ERROR  Invalid parameter.
  */
HAL_StatusTypeDef HAL_PLAY_LUT_GetConfig(HAL_PLAY_HandleTypeDef *hplay, HAL_PLAY_LUT_ConfTypeDef *p_config,
                                         uint32_t array_size)
{
  const PLAY_TypeDef *p_playx;

  /* Check the parameters */
  if (hplay == NULL)
  {
    return HAL_ERROR;
  }

  p_playx = PLAY_GET_INSTANCE(hplay);

  if ((p_config == NULL) || (array_size > PLAY_INPUT_MUX_NBR(p_playx)))
  {
    hplay->ErrorCode |= HAL_PLAY_ERROR_INVALID_PARAM;

    return HAL_ERROR;
  }

  assert_param(((array_size > 0UL) && (array_size <= PLAY_LUT_NBR(p_playx))));

  for (uint32_t idx = 0; idx < array_size; idx++)
  {
    p_config[idx].lut = (HAL_PLAY_LUTTypeDef)idx;
    p_config[idx].truth_table = LL_PLAY_LUT_GetTruthTable(p_playx, idx);
    p_config[idx].clk_gate_source = (HAL_PLAY_LUT_ClkGateSourceTypeDef)LL_PLAY_LUT_GetClockGate(p_playx, idx);
    p_config[idx].input_source[LL_PLAY_LUT_INPUT0] =
      (HAL_PLAY_LUT_InputSourceTypeDef)LL_PLAY_LUT_GetSource(p_playx, idx, LL_PLAY_LUT_INPUT0);
    p_config[idx].input_source[LL_PLAY_LUT_INPUT1] =
      (HAL_PLAY_LUT_InputSourceTypeDef)LL_PLAY_LUT_GetSource(p_playx, idx, LL_PLAY_LUT_INPUT1);
    p_config[idx].input_source[LL_PLAY_LUT_INPUT2] =
      (HAL_PLAY_LUT_InputSourceTypeDef)LL_PLAY_LUT_GetSource(p_playx, idx, LL_PLAY_LUT_INPUT2);
    p_config[idx].input_source[LL_PLAY_LUT_INPUT3] =
      (HAL_PLAY_LUT_InputSourceTypeDef)LL_PLAY_LUT_GetSource(p_playx, idx, LL_PLAY_LUT_INPUT3);
  }

  return HAL_OK;
}

/**
  * @brief  Configure a set of output multiplexers for the PLAY peripheral.
  * @param  hplay      Pointer to a @ref HAL_PLAY_HandleTypeDef.
  * @param  p_config   Pointer to an array of @ref HAL_PLAY_OUT_ConfTypeDef.
  * @param  array_size Number of configurations in the array.
  * @retval HAL_OK     Operation completed successfully.
  * @retval HAL_ERROR  Invalid parameter or wrong state.
  */
HAL_StatusTypeDef HAL_PLAY_OUTPUT_SetConfig(HAL_PLAY_HandleTypeDef *hplay, const HAL_PLAY_OUT_ConfTypeDef *p_config,
                                            uint32_t array_size)
{
  PLAY_TypeDef *p_playx;
  HAL_PLAY_StateTypeDef tmp_state;
  uint32_t is_locked;

  /* Check the parameters */
  if (hplay == NULL)
  {
    return HAL_ERROR;
  }

