zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/drivers/src/stm32h5xx_hal_play.c
  p_playx = PLAY_GET_INSTANCE(hplay);

  if ((p_config == NULL) || (array_size > PLAY_INPUT_MUX_NBR(p_playx)))
  {
    hplay->ErrorCode = HAL_PLAY_ERROR_INVALID_PARAM;

    return HAL_ERROR;
  }

  assert_param(((array_size > 0UL) && (array_size <= PLAY_OUTPUT_MUX_NBR(p_playx))));

  /* Check the peripheral state */
  tmp_state = hplay->State;
  if ((tmp_state != HAL_PLAY_STATE_INIT) && (tmp_state != HAL_PLAY_STATE_READY))
  {
    return HAL_ERROR;
  }

  /* Unlock the configuration if not already done */
  is_locked = LL_PLAY_IsLocked(p_playx);
  if (is_locked != 0U)
  {
    LL_PLAY_Unlock(p_playx);
  }

  /* Configure the Logic Array Output */
  for (uint32_t idx = 0; idx < array_size; idx++)
  {
    assert_param(IS_PLAY_OUT(p_config[idx].output_mux));
    assert_param(IS_PLAY_OUT_SOURCE(p_playx, p_config[idx].lut_output));

    LL_PLAY_OUTPUT_SetSource(p_playx, (uint32_t)p_config[idx].output_mux, (uint32_t)p_config[idx].lut_output);
  }

  hplay->State = HAL_PLAY_STATE_READY;

  return HAL_OK;
}

/**
  * @brief Retrieve the output multiplexer configurations of the PLAY peripheral in order from 0 to (array_size - 1),
  *        where array_size specifies the number of configurations.
  * @param  hplay      Pointer to a @ref HAL_PLAY_HandleTypeDef.
  * @param  p_config   Pointer to an array of @ref HAL_PLAY_OUT_ConfTypeDef.
  * @param  array_size Number of configurations in the array.
  * @retval HAL_OK     Operation completed successfully.
  * @retval HAL_ERROR  Invalid parameter.
  */
HAL_StatusTypeDef HAL_PLAY_OUTPUT_GetConfig(HAL_PLAY_HandleTypeDef *hplay, HAL_PLAY_OUT_ConfTypeDef *p_config,
                                            uint32_t array_size)
{
  const PLAY_TypeDef *p_playx;

  /* Check the parameters */
  if (hplay == NULL)
  {
    return HAL_ERROR;
  }

  p_playx = PLAY_GET_INSTANCE(hplay);

  if ((p_config == NULL) || (array_size > PLAY_INPUT_MUX_NBR(p_playx)))
  {
    hplay->ErrorCode = HAL_PLAY_ERROR_INVALID_PARAM;

    return HAL_ERROR;
  }

  assert_param(((array_size > 0UL) && (array_size <= PLAY_OUTPUT_MUX_NBR(p_playx))));

  for (uint32_t idx = 0; idx < array_size; idx++)
  {
    p_config[idx].output_mux = (HAL_PLAY_OUTTypeDef)idx;
    p_config[idx].lut_output = LL_PLAY_OUTPUT_GetSource(p_playx, idx);
  }

  return HAL_OK;
}

/* PLAY Configuration - Unitary functions ***************************************/

/**
  * @brief  Set the signal source for an input multiplexer of the PLAY peripheral.
  * @param  hplay  Pointer to a @ref HAL_PLAY_HandleTypeDef.
  * @param  source Input source signal.
  * @retval HAL_OK    Operation completed successfully.
  * @retval HAL_ERROR Invalid parameter or wrong state.
  */
HAL_StatusTypeDef HAL_PLAY_INPUT_SetSource(const HAL_PLAY_HandleTypeDef *hplay, HAL_PLAY_IN_SourceTypeDef source)
{
  PLAY_TypeDef *p_playx;

  /* Check the parameters */
  if (hplay == NULL)
  {
    return HAL_ERROR;
  }

  p_playx = PLAY_GET_INSTANCE(hplay);

  assert_param(IS_PLAY_IN_SOURCE(p_playx, source));

  /* Check the peripheral state */
  if (hplay->State != HAL_PLAY_STATE_READY)
  {
    return HAL_ERROR;
  }

  uint32_t src_u32 = (uint32_t)source;

  /* Retrieve the input mux */
  uint32_t input_mux = (src_u32 & PLAY_IN_MUX_MASK) >> HAL_PLAY_IN_MUX_POS;
  uint32_t mux_sel = src_u32 & PLAY_IN_MUX_VALUE_MASK;

  LL_PLAY_INPUT_SetSource(p_playx, input_mux, mux_sel);

  return HAL_OK;
}

/**
  * @brief  Retrieve the signal source for an input multiplexer of the PLAY peripheral.
  * @param  hplay     Pointer to a @ref HAL_PLAY_HandleTypeDef.
  * @param  input_mux Input multiplexer.
  * @note   Function will return @ref HAL_PLAY_IN_SOURCE_INVALID if the parameters are invalid.
  * @return Input source signal.
  */
HAL_PLAY_IN_SourceTypeDef HAL_PLAY_INPUT_GetSource(const HAL_PLAY_HandleTypeDef *hplay, HAL_PLAY_INTypeDef input_mux)
{
  /* Check the parameters */
  if (hplay == NULL)
  {
    return HAL_PLAY_IN_SOURCE_INVALID;
  }

  assert_param(IS_PLAY_IN(input_mux));

  /* Rebuild the source signal */
  uint32_t instance_id = (uint32_t)PLAY_GET_INSTANCE_ID(hplay);
  uint32_t mux_sel = (uint32_t)input_mux << HAL_PLAY_IN_MUX_POS;
  uint32_t source = LL_PLAY_INPUT_GetSource(PLAY_GET_INSTANCE(hplay), (uint32_t)input_mux);

  uint32_t ret = (instance_id | mux_sel | source);

  return (HAL_PLAY_IN_SourceTypeDef)ret;
}

/**
  * @brief  Set the minimum pulse width for an input filter of the PLAY peripheral.
  * @param  hplay     Pointer to a @ref HAL_PLAY_HandleTypeDef.
  * @param  input_mux Input multiplexer.
  * @param  width     Pulse width in play_clk clock cycles, in range [0..255].
  *                   Value 0 means that the filter is bypassed.
  * @retval HAL_OK    Operation completed successfully.
  * @retval HAL_ERROR Invalid parameter or wrong state.
  */
HAL_StatusTypeDef HAL_PLAY_INPUT_SetMinPulseWidth(const HAL_PLAY_HandleTypeDef *hplay, HAL_PLAY_INTypeDef input_mux,
                                                  uint32_t width)
{
  /* Check the parameters */
  if (hplay == NULL)
  {
    return HAL_ERROR;
  }

  assert_param(IS_PLAY_IN(input_mux));
  assert_param(IS_PLAY_MIN_PULSE_WIDTH(width));

  /* Check the peripheral state */
  if (hplay->State != HAL_PLAY_STATE_READY)
  {
    return HAL_ERROR;
  }

  LL_PLAY_INPUT_SetMinimumPulseWidth(PLAY_GET_INSTANCE(hplay), (uint32_t)input_mux, width);

  return HAL_OK;
}

/**
  * @brief  Retrieve the minimum pulse width configured for an input filter of the PLAY peripheral.
  * @param  hplay     Pointer to a @ref HAL_PLAY_HandleTypeDef.
  * @param  input_mux Input multiplexer.
  * @note   Function will return 0 if the parameters are invalid.
  * @return Pulse width in play_clk clock cycles, in range [0..255]. Value 0 means that the filter is bypassed.
  */
uint32_t HAL_PLAY_INPUT_GetMinPulseWidth(const HAL_PLAY_HandleTypeDef *hplay, HAL_PLAY_INTypeDef input_mux)
{
  /* Check the parameters */
  if (hplay == NULL)
  {
    return 0U;
  }

  assert_param(IS_PLAY_IN(input_mux));

  return LL_PLAY_INPUT_GetMinimumPulseWidth(PLAY_GET_INSTANCE(hplay), (uint32_t)input_mux);
}

/**
  * @brief  Configure the edge detection mode for an input filter of the PLAY peripheral.
  * @param  hplay     Pointer to a @ref HAL_PLAY_HandleTypeDef.
  * @param  input_mux Input multiplexer.
  * @param  mode      Mode of Edge Detection.
  * @retval HAL_OK    Operation completed successfully.
  * @retval HAL_ERROR Invalid parameter or wrong state.
  */
HAL_StatusTypeDef HAL_PLAY_INPUT_SetEdgeDetectionMode(const HAL_PLAY_HandleTypeDef *hplay, HAL_PLAY_INTypeDef input_mux,
                                                      HAL_PLAY_EdgeDetectionModeTypeDef mode)
{
  /* Check the parameters */
  if (hplay == NULL)
  {
    return HAL_ERROR;
  }

  assert_param(IS_PLAY_IN(input_mux));
  assert_param(IS_PLAY_EDGE_DETECTION_MODE(mode));

  /* Check the peripheral state */
  if (hplay->State != HAL_PLAY_STATE_READY)
  {
    return HAL_ERROR;
  }

  LL_PLAY_INPUT_SetEdgeDetectionMode(PLAY_GET_INSTANCE(hplay), (uint32_t)input_mux, (uint32_t)mode);

  return HAL_OK;
}

/**
  * @brief  Retrieve the edge detection mode configured for an input filter of the PLAY peripheral.
  * @param  hplay     Pointer to a @ref HAL_PLAY_HandleTypeDef.
  * @param  input_mux Input multiplexer.
  * @note   Function will return @ref HAL_PLAY_EDGE_DETECTION_BYPASSED if the parameters are invalid.
  * @return Edge Detection mode.
  */
HAL_PLAY_EdgeDetectionModeTypeDef HAL_PLAY_INPUT_GetEdgeDetectionMode(const HAL_PLAY_HandleTypeDef *hplay,
                                                                      HAL_PLAY_INTypeDef input_mux)
{
  /* Check the parameters */
  if (hplay == NULL)
  {
    return HAL_PLAY_EDGE_DETECTION_BYPASSED;
  }

  assert_param(IS_PLAY_IN(input_mux));

  return (HAL_PLAY_EdgeDetectionModeTypeDef)LL_PLAY_INPUT_GetEdgeDetectionMode(PLAY_GET_INSTANCE(hplay),
                                                                               (uint32_t)input_mux);
}

/* PLAY Configuration - Unitary functions for lookup table *********************/

/**
  * @brief  Set the truth table value for a lookup table in the PLAY peripheral.
  * @param  hplay             Pointer to a @ref HAL_PLAY_HandleTypeDef.
  * @param  lut               Lookup table.
  * @param  truth_table_value The value can be in range [0..0xFFFF].
  * @retval HAL_OK Operation completed successfully.
  * @retval HAL_ERROR Invalid parameter or wrong state.
  */
HAL_StatusTypeDef HAL_PLAY_LUT_SetTruthTable(const HAL_PLAY_HandleTypeDef *hplay, HAL_PLAY_LUTTypeDef lut,
                                             uint32_t truth_table_value)
{
  PLAY_TypeDef *p_playx;

  /* Check the parameters */
  if (hplay == NULL)
  {
    return HAL_ERROR;
  }

