zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/drivers/src/stm32h5xx_hal_play.c
  p_playx = PLAY_GET_INSTANCE(hplay);

  assert_param(IS_PLAY_LUT(p_playx, lut));
  assert_param(IS_PLAY_LUT_TRUTH_TABLE_VALUE(truth_table_value));

  /* Check the peripheral state */
  if (hplay->State != HAL_PLAY_STATE_READY)
  {
    return HAL_ERROR;
  }

  /* Set the LUT value */
  LL_PLAY_LUT_SetTruthTable(p_playx, (uint32_t)lut, truth_table_value);

  return HAL_OK;
}

/**
  * @brief  Retrieve the truth table value for a lookup table in the PLAY peripheral.
  * @param  hplay Pointer to a @ref HAL_PLAY_HandleTypeDef.
  * @param  lut   Lookup table.
  * @note   Function will return 0 if the parameters are invalid.
  * @return Value in range [0..0xFFFF].
  */
uint32_t HAL_PLAY_LUT_GetTruthTable(const HAL_PLAY_HandleTypeDef *hplay, HAL_PLAY_LUTTypeDef lut)
{
  const PLAY_TypeDef *p_playx;

  /* Check the parameters */
  if (hplay == NULL)
  {
    return 0U;
  }

  p_playx = PLAY_GET_INSTANCE(hplay);

  assert_param(IS_PLAY_LUT(p_playx, lut));

  return LL_PLAY_LUT_GetTruthTable(p_playx, (uint32_t)lut);
}

/**
  * @brief  Set the signal source for a lookup table input in the PLAY peripheral.
  * @param  hplay        Pointer to a @ref HAL_PLAY_HandleTypeDef.
  * @param  lut          Lookup table.
  * @param  lut_input    Lookup table Input.
  * @param  input_source Signal source.
  * @retval HAL_OK       Operation completed successfully.
  * @retval HAL_ERROR    Invalid parameter or wrong state.
  */
HAL_StatusTypeDef HAL_PLAY_LUT_SetSource(const HAL_PLAY_HandleTypeDef *hplay, HAL_PLAY_LUTTypeDef lut,
                                         HAL_PLAY_LUT_InputTypeDef lut_input,
                                         HAL_PLAY_LUT_InputSourceTypeDef input_source)
{
  PLAY_TypeDef *p_playx;

  /* Check the parameters */
  if (hplay == NULL)
  {
    return HAL_ERROR;
  }

  p_playx = PLAY_GET_INSTANCE(hplay);

  assert_param(IS_PLAY_LUT(p_playx, lut));
  assert_param(IS_PLAY_LUT_INPUT(lut_input));
  assert_param(IS_PLAY_LUT_INPUT_SOURCE(p_playx, lut, input_source));

  /* Check the peripheral state */
  if (hplay->State != HAL_PLAY_STATE_READY)
  {
    return HAL_ERROR;
  }

  LL_PLAY_LUT_SetSource(p_playx, (uint32_t)lut, (uint32_t)lut_input, (uint32_t)input_source);

  return HAL_OK;
}

/**
  * @brief  Retrieve the signal source for a lookup table input in the PLAY peripheral.
  * @param  hplay     Pointer to a @ref HAL_PLAY_HandleTypeDef.
  * @param  lut       Lookup table.
  * @param  lut_input Lookup table Input.
  * @note   Function will return @ref HAL_PLAY_LUT_INPUT_DEFAULT if the parameters are invalid.
  * @return Lookup table input source.
  */
HAL_PLAY_LUT_InputSourceTypeDef HAL_PLAY_LUT_GetSource(const HAL_PLAY_HandleTypeDef *hplay, HAL_PLAY_LUTTypeDef lut,
                                                       HAL_PLAY_LUT_InputTypeDef lut_input)
{
  const PLAY_TypeDef *p_playx;

  /* Check the parameters */
  if (hplay == NULL)
  {
    return HAL_PLAY_LUT_INPUT_DEFAULT;
  }

  p_playx = PLAY_GET_INSTANCE(hplay);

  assert_param(IS_PLAY_LUT(p_playx, lut));
  assert_param(IS_PLAY_LUT_INPUT(lut_input));

  return (HAL_PLAY_LUT_InputSourceTypeDef)LL_PLAY_LUT_GetSource(p_playx, (uint32_t)lut, (uint32_t)lut_input);
}

/**
  * @brief  Set the clock gate source for a lookup table in the PLAY peripheral.
  * @param  hplay  Pointer to a @ref HAL_PLAY_HandleTypeDef.
  * @param  lut    Lookup table.
  * @param  source Signal source.
  * @retval HAL_OK    Operation completed successfully.
  * @retval HAL_ERROR Invalid parameter or wrong state.
  */
HAL_StatusTypeDef HAL_PLAY_LUT_SetClockGateSource(const HAL_PLAY_HandleTypeDef *hplay, HAL_PLAY_LUTTypeDef lut,
                                                  HAL_PLAY_LUT_ClkGateSourceTypeDef source)
{
  PLAY_TypeDef *p_playx;

  /* Check the parameters */
  if (hplay == NULL)
  {
    return HAL_ERROR;
  }

  p_playx = PLAY_GET_INSTANCE(hplay);

  assert_param(IS_PLAY_LUT(p_playx, lut));
  assert_param(IS_PLAY_LUT_CLOCK_GATE_SOURCE(p_playx, source));

  /* Check the peripheral state */
  if (hplay->State != HAL_PLAY_STATE_READY)
  {
    return HAL_ERROR;
  }

  LL_PLAY_LUT_SetClockGate(p_playx, (uint32_t)lut, (uint32_t)source);

  return HAL_OK;
}

/**
  * @brief  Retrieve the clock gate source for a lookup table in the PLAY peripheral.
  * @param  hplay Pointer to a @ref HAL_PLAY_HandleTypeDef.
  * @param  lut   Lookup table.
  * @note   Function will return @ref HAL_PLAY_LUT_CLK_GATE_OFF if the parameters are invalid.
  * @return Lookup table clock gate source.
  */
HAL_PLAY_LUT_ClkGateSourceTypeDef HAL_PLAY_LUT_GetClockGateSource(const HAL_PLAY_HandleTypeDef *hplay,
                                                                  HAL_PLAY_LUTTypeDef lut)
{
  const PLAY_TypeDef *p_playx;

  /* Check the parameters */
  if (hplay == NULL)
  {
    return HAL_PLAY_LUT_CLK_GATE_OFF;
  }

  p_playx = PLAY_GET_INSTANCE(hplay);

  assert_param(IS_PLAY_LUT(p_playx, lut));

  return (HAL_PLAY_LUT_ClkGateSourceTypeDef)LL_PLAY_LUT_GetClockGate(p_playx, (uint32_t)lut);
}

/* PLAY Configuration - Unitary functions for output ****************************/

/**
  * @brief  Set the source signal for an output multiplexer of the PLAY peripheral.
  * @param  hplay      Pointer to a @ref HAL_PLAY_HandleTypeDef.
  * @param  output_mux Output multiplexer.
  * @param  source     Lookup table output. This parameter can be one of the following values:
  *                    @arg @ref HAL_PLAY_LUT0_OUT_DIRECT
  *                    @arg @ref HAL_PLAY_LUT1_OUT_DIRECT
  *                    @arg @ref HAL_PLAY_LUT2_OUT_DIRECT
  *                    @arg @ref HAL_PLAY_LUT3_OUT_DIRECT
  *                    @arg @ref HAL_PLAY_LUT4_OUT_DIRECT
  *                    @arg @ref HAL_PLAY_LUT5_OUT_DIRECT
  *                    @arg @ref HAL_PLAY_LUT6_OUT_DIRECT
  *                    @arg @ref HAL_PLAY_LUT7_OUT_DIRECT
  *                    @arg @ref HAL_PLAY_LUT8_OUT_DIRECT
  *                    @arg @ref HAL_PLAY_LUT9_OUT_DIRECT
  *                    @arg @ref HAL_PLAY_LUT10_OUT_DIRECT
  *                    @arg @ref HAL_PLAY_LUT11_OUT_DIRECT
  *                    @arg @ref HAL_PLAY_LUT12_OUT_DIRECT
  *                    @arg @ref HAL_PLAY_LUT13_OUT_DIRECT
  *                    @arg @ref HAL_PLAY_LUT14_OUT_DIRECT
  *                    @arg @ref HAL_PLAY_LUT15_OUT_DIRECT
  *                    @arg @ref HAL_PLAY_LUT0_OUT_REGISTERED
  *                    @arg @ref HAL_PLAY_LUT1_OUT_REGISTERED
  *                    @arg @ref HAL_PLAY_LUT2_OUT_REGISTERED
  *                    @arg @ref HAL_PLAY_LUT3_OUT_REGISTERED
  *                    @arg @ref HAL_PLAY_LUT4_OUT_REGISTERED
  *                    @arg @ref HAL_PLAY_LUT5_OUT_REGISTERED
  *                    @arg @ref HAL_PLAY_LUT6_OUT_REGISTERED
  *                    @arg @ref HAL_PLAY_LUT7_OUT_REGISTERED
  *                    @arg @ref HAL_PLAY_LUT8_OUT_REGISTERED
  *                    @arg @ref HAL_PLAY_LUT9_OUT_REGISTERED
  *                    @arg @ref HAL_PLAY_LUT10_OUT_REGISTERED
  *                    @arg @ref HAL_PLAY_LUT11_OUT_REGISTERED
  *                    @arg @ref HAL_PLAY_LUT12_OUT_REGISTERED
  *                    @arg @ref HAL_PLAY_LUT13_OUT_REGISTERED
  *                    @arg @ref HAL_PLAY_LUT14_OUT_REGISTERED
  *                    @arg @ref HAL_PLAY_LUT15_OUT_REGISTERED
  * @retval HAL_OK    Operation completed successfully.
  * @retval HAL_ERROR Invalid parameter or wrong state.
  */
HAL_StatusTypeDef HAL_PLAY_OUTPUT_SetSource(const HAL_PLAY_HandleTypeDef *hplay, HAL_PLAY_OUTTypeDef output_mux,
                                            uint32_t source)
{
  PLAY_TypeDef *p_playx;

  /* Check the parameters */
  if (hplay == NULL)
  {
    return HAL_ERROR;
  }

