zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/drivers/src/stm32h5xx_hal_play.c
  p_playx = PLAY_GET_INSTANCE(hplay);

  assert_param(IS_PLAY_OUT(output_mux));
  assert_param(IS_PLAY_OUT_SOURCE(p_playx, source));

  /* Check the peripheral state */
  if (hplay->State != HAL_PLAY_STATE_READY)
  {
    return HAL_ERROR;
  }

  LL_PLAY_OUTPUT_SetSource(p_playx, (uint32_t)output_mux, source);

  return HAL_OK;
}

/**
  * @brief  Retrieve the source signal configured for an output multiplexer of the PLAY peripheral.
  * @param  hplay      Pointer to a @ref HAL_PLAY_HandleTypeDef.
  * @param  output_mux Output multiplexer.
  * @note   Function will return 0 if the parameters are invalid.
  * @return Returned value can be one of the following values:
  *         @arg @ref HAL_PLAY_LUT0_OUT_DIRECT
  *         @arg @ref HAL_PLAY_LUT1_OUT_DIRECT
  *         @arg @ref HAL_PLAY_LUT2_OUT_DIRECT
  *         @arg @ref HAL_PLAY_LUT3_OUT_DIRECT
  *         @arg @ref HAL_PLAY_LUT4_OUT_DIRECT
  *         @arg @ref HAL_PLAY_LUT5_OUT_DIRECT
  *         @arg @ref HAL_PLAY_LUT6_OUT_DIRECT
  *         @arg @ref HAL_PLAY_LUT7_OUT_DIRECT
  *         @arg @ref HAL_PLAY_LUT8_OUT_DIRECT
  *         @arg @ref HAL_PLAY_LUT9_OUT_DIRECT
  *         @arg @ref HAL_PLAY_LUT10_OUT_DIRECT
  *         @arg @ref HAL_PLAY_LUT11_OUT_DIRECT
  *         @arg @ref HAL_PLAY_LUT12_OUT_DIRECT
  *         @arg @ref HAL_PLAY_LUT13_OUT_DIRECT
  *         @arg @ref HAL_PLAY_LUT14_OUT_DIRECT
  *         @arg @ref HAL_PLAY_LUT15_OUT_DIRECT
  *         @arg @ref HAL_PLAY_LUT0_OUT_REGISTERED
  *         @arg @ref HAL_PLAY_LUT1_OUT_REGISTERED
  *         @arg @ref HAL_PLAY_LUT2_OUT_REGISTERED
  *         @arg @ref HAL_PLAY_LUT3_OUT_REGISTERED
  *         @arg @ref HAL_PLAY_LUT4_OUT_REGISTERED
  *         @arg @ref HAL_PLAY_LUT5_OUT_REGISTERED
  *         @arg @ref HAL_PLAY_LUT6_OUT_REGISTERED
  *         @arg @ref HAL_PLAY_LUT7_OUT_REGISTERED
  *         @arg @ref HAL_PLAY_LUT8_OUT_REGISTERED
  *         @arg @ref HAL_PLAY_LUT9_OUT_REGISTERED
  *         @arg @ref HAL_PLAY_LUT10_OUT_REGISTERED
  *         @arg @ref HAL_PLAY_LUT11_OUT_REGISTERED
  *         @arg @ref HAL_PLAY_LUT12_OUT_REGISTERED
  *         @arg @ref HAL_PLAY_LUT13_OUT_REGISTERED
  *         @arg @ref HAL_PLAY_LUT14_OUT_REGISTERED
  *         @arg @ref HAL_PLAY_LUT15_OUT_REGISTERED
  */
uint32_t HAL_PLAY_OUTPUT_GetSource(const HAL_PLAY_HandleTypeDef *hplay, HAL_PLAY_OUTTypeDef output_mux)
{
  /* Check the parameters */
  if (hplay == NULL)
  {
    return 0U;
  }

  assert_param(IS_PLAY_OUT(output_mux));

  return LL_PLAY_OUTPUT_GetSource(PLAY_GET_INSTANCE(hplay), (uint32_t)output_mux);
}

/**
  * @}
  */

/** @addtogroup PLAY_Exported_Functions_Group3
  * @{
A set of functions allowing to start/stop the PLAYx peripheral:
- HAL_PLAY_Start()
- HAL_PLAY_Stop()
  */

/**
  * @brief  Start the PLAY peripheral.
  * @param  hplay    Pointer to a @ref HAL_PLAY_HandleTypeDef.
  * @param  p_config Pointer to a @ref HAL_PLAY_EdgeTriggerConfTypeDef.
  * @note   The falling and rising edge configuration is exclusive and thus, a lookup table output cannot be
  *         configured for both rising and falling edges at the same time.
  * @retval HAL_OK    Operation completed successfully.
  * @retval HAL_ERROR Invalid parameter or wrong state.
  */
HAL_StatusTypeDef HAL_PLAY_Start(HAL_PLAY_HandleTypeDef *hplay, const HAL_PLAY_EdgeTriggerConfTypeDef *p_config)
{
  PLAY_TypeDef *p_playx;
  uint32_t is_locked;

  /* Check the parameters */
  if (hplay == NULL)
  {
    return HAL_ERROR;
  }

  p_playx = PLAY_GET_INSTANCE(hplay);

  if (p_config == NULL)
  {
    hplay->ErrorCode |= HAL_PLAY_ERROR_INVALID_PARAM;

    return HAL_ERROR;
  }

  assert_param((p_config->lut_out_falling_mask & p_config->lut_out_rising_mask) == 0U);

  /* Check the peripheral state */
  if (hplay->State != HAL_PLAY_STATE_READY)
  {
    return HAL_ERROR;
  }

  /* Lock the configuration only if it is currently unlocked.
     In context where configuration register requires a privilege and/or secure write access:
     - this check prevents generating an unexpected illegal access (ilac) event if the caller does not have
       the required permissions.
    - if the configuration is unlocked and the caller lacks write access, attempting to lock will fail and
      generate an expected illegal access (ilac) event.
  */
  is_locked = LL_PLAY_IsLocked(p_playx);
  if (is_locked == 0U)
  {
    LL_PLAY_Lock(p_playx);
  }

  hplay->State = HAL_PLAY_STATE_BUSY;

  return PLAY_LUT_SetEdgeTrigger(hplay, p_config, PLAY_WRITE_TIMEOUT_MS);
}

/**
  * @brief  Stop the PLAY peripheral.
  *         The API disables all the lookup table output Interrupts and unlocks the configuration registers.
  *         All features having a dependency with the kernel clock are held in reset.
  * @param  hplay  Pointer to a @ref HAL_PLAY_HandleTypeDef.
  * @retval HAL_OK    Operation completed successfully.
  * @retval HAL_ERROR Invalid parameter or wrong state.
  */
HAL_StatusTypeDef HAL_PLAY_Stop(HAL_PLAY_HandleTypeDef *hplay)
{
  PLAY_TypeDef *p_playx;

  /* Check the parameters */
  if (hplay == NULL)
  {
    return HAL_ERROR;
  }

  p_playx = PLAY_GET_INSTANCE(hplay);

  /* Check the peripheral state */
  if (hplay->State != HAL_PLAY_STATE_BUSY)
  {
    return HAL_ERROR;
  }

  /* Disable all lookup table Output Interrupts */
  LL_PLAY_LUT_DisableIT(p_playx, LL_PLAY_LUT_ALL_OUT_REGISTERED | LL_PLAY_LUT_ALL_OUT_DIRECT);

  LL_PLAY_Unlock(p_playx);

  hplay->State = HAL_PLAY_STATE_READY;

  return HAL_OK;
}

/**
  * @}
  */

/** @addtogroup PLAY_Exported_Functions_Group4
  * @{
A set of functions allowing to manage the lookup table Output of PLAYx peripheral:
- HAL_PLAY_LUT_SetEdgeTrigger()
- HAL_PLAY_LUT_SetEdgeTrigger_IT()
- HAL_PLAY_LUT_GetEdgeTrigger()
- HAL_PLAY_LUT_PollForEdgeTrigger()
- HAL_PLAY_LUT_EnableIT()
- HAL_PLAY_LUT_DisableIT()
- HAL_PLAY_LUT_GetIT()
  */

/**
  * @brief  Configure the Edge Triggers: flag transition of lookup table outputs.
  * @param  hplay      Pointer to a @ref HAL_PLAY_HandleTypeDef.
  * @param  p_config   Pointer to a @ref HAL_PLAY_EdgeTriggerConfTypeDef structure for the Edge Triggers configuration.
  * @param  timeout_ms Timeout duration (in ms).
  * @note   The falling and rising edge configuration is exclusive and thus, a lookup table output cannot be
  *         configured for both rising and falling edges at the same time.
  * @retval HAL_OK    Operation completed successfully.
  * @retval HAL_BUSY  A write is pending.
  * @retval HAL_ERROR Invalid parameter or wrong state.
  */
HAL_StatusTypeDef HAL_PLAY_LUT_SetEdgeTrigger(HAL_PLAY_HandleTypeDef *hplay,
                                              const HAL_PLAY_EdgeTriggerConfTypeDef *p_config,
                                              uint32_t timeout_ms)
{
  /* Check the parameters */
  if (hplay == NULL)
  {
    return HAL_ERROR;
  }

  if (p_config == NULL)
  {
    hplay->ErrorCode |= HAL_PLAY_ERROR_INVALID_PARAM;

    return HAL_ERROR;
  }

  assert_param((p_config->lut_out_falling_mask & p_config->lut_out_rising_mask) == 0U);

