zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/drivers/src/stm32h5xx_hal_play.c
  if (hplay->State != HAL_PLAY_STATE_BUSY)
  {
    return HAL_ERROR;
  }

  return PLAY_LUT_SetEdgeTrigger(hplay, p_config, timeout_ms);
}

/**
  * @brief  Configure the Edge Triggers in interrupt mode: flag transition of lookup table outputs.
  * @param  hplay    Pointer to a @ref HAL_PLAY_HandleTypeDef.
  * @param  p_config Pointer to a @ref HAL_PLAY_EdgeTriggerConfTypeDef structure for the Edge Triggers configuration.
  * @note   The falling and rising edge configuration is exclusive and thus, a lookup table output cannot be
  *         configured for both rising and falling edges at the same time.
  * @retval HAL_OK    Operation completed successfully.
  * @retval HAL_BUSY  A write is pending.
  * @retval HAL_ERROR Invalid parameter or wrong state.
  */
HAL_StatusTypeDef HAL_PLAY_LUT_SetEdgeTrigger_IT(HAL_PLAY_HandleTypeDef *hplay,
                                                 const HAL_PLAY_EdgeTriggerConfTypeDef *p_config)
{
  PLAY_TypeDef *p_playx;

  /* Check the parameters */
  if (hplay == NULL)
  {
    return HAL_ERROR;
  }

  p_playx = PLAY_GET_INSTANCE(hplay);

  if (p_config == NULL)
  {
    hplay->ErrorCode |= HAL_PLAY_ERROR_INVALID_PARAM;

    return HAL_ERROR;
  }

  assert_param((p_config->lut_out_falling_mask & p_config->lut_out_rising_mask) == 0U);

  if (hplay->State != HAL_PLAY_STATE_BUSY)
  {
    return HAL_ERROR;
  }

  /* Check if a write access is available */
  if (LL_PLAY_LUT_IsEdgeTriggerWriteBusy(p_playx) != 0U)
  {
    return HAL_BUSY;
  }

  LL_PLAY_LUT_EnableIT_EdgeTriggerWriteComplete(p_playx);

  /* Update Transition */
  LL_PLAY_LUT_SetEdgeTrigger(p_playx, p_config->lut_out_falling_mask, p_config->lut_out_rising_mask);

  return HAL_OK;
}

/**
  * @brief  Get the Edge Triggers configuration of all lookup table outputs.
  * @param  hplay    Pointer to a @ref HAL_PLAY_HandleTypeDef.
  * @param  p_config Pointer to a @ref HAL_PLAY_EdgeTriggerConfTypeDef structure to be filled.
  * @retval HAL_OK    Operation completed successfully.
  * @retval HAL_ERROR Invalid parameter.
  */
HAL_StatusTypeDef HAL_PLAY_LUT_GetEdgeTrigger(HAL_PLAY_HandleTypeDef *hplay, HAL_PLAY_EdgeTriggerConfTypeDef *p_config)
{
  const PLAY_TypeDef *p_playx;

  /* Check the parameters */
  if (hplay == NULL)
  {
    return HAL_ERROR;
  }

  p_playx = PLAY_GET_INSTANCE(hplay);

  if (p_config == NULL)
  {
    hplay->ErrorCode |= HAL_PLAY_ERROR_INVALID_PARAM;

    return HAL_ERROR;
  }

  /* Retrieve the configuration */
  p_config->lut_out_rising_mask = LL_PLAY_LUT_GetEdgeTrigger(p_playx);
  p_config->lut_out_falling_mask = ~p_config->lut_out_rising_mask;

  return HAL_OK;
}

/**
  * @brief  Poll on Lookup table Output Flags.
  * @param  hplay                   Pointer to a @ref HAL_PLAY_HandleTypeDef.
  * @param  poll_mode               Polling mode of type @ref HAL_PLAY_PollingEdgeTriggerTypeDef.
  * @param  edge_trig_mask          Mask of flags to poll.
  *                                 This parameter can be a combination of the following values:
  *                                 @arg @ref HAL_PLAY_LUT0_OUT_DIRECT :        The flag of LUT0 direct output
  *                                 @arg @ref HAL_PLAY_LUT1_OUT_DIRECT :        The flag of LUT1 direct output
  *                                 @arg @ref HAL_PLAY_LUT2_OUT_DIRECT :        The flag of LUT2 direct output
  *                                 @arg @ref HAL_PLAY_LUT3_OUT_DIRECT :        The flag of LUT3 direct output
  *                                 @arg @ref HAL_PLAY_LUT4_OUT_DIRECT :        The flag of LUT4 direct output
  *                                 @arg @ref HAL_PLAY_LUT5_OUT_DIRECT :        The flag of LUT5 direct output
  *                                 @arg @ref HAL_PLAY_LUT6_OUT_DIRECT :        The flag of LUT6 direct output
  *                                 @arg @ref HAL_PLAY_LUT7_OUT_DIRECT :        The flag of LUT7 direct output
  *                                 @arg @ref HAL_PLAY_LUT8_OUT_DIRECT :        The flag of LUT8 direct output
  *                                 @arg @ref HAL_PLAY_LUT9_OUT_DIRECT :        The flag of LUT9 direct output
  *                                 @arg @ref HAL_PLAY_LUT10_OUT_DIRECT :       The flag of LUT10 direct output
  *                                 @arg @ref HAL_PLAY_LUT11_OUT_DIRECT :       The flag of LUT11 direct output
  *                                 @arg @ref HAL_PLAY_LUT12_OUT_DIRECT :       The flag of LUT12 direct output
  *                                 @arg @ref HAL_PLAY_LUT13_OUT_DIRECT :       The flag of LUT13 direct output
  *                                 @arg @ref HAL_PLAY_LUT14_OUT_DIRECT :       The flag of LUT14 direct output
  *                                 @arg @ref HAL_PLAY_LUT15_OUT_DIRECT :       The flag of LUT15 direct output
  *                                 @arg @ref HAL_PLAY_LUT_ALL_OUT_DIRECT :     All flags of LUTs direct outputs
  *                                 @arg @ref HAL_PLAY_LUT0_OUT_REGISTERED :    The flag of LUT0 registered output
  *                                 @arg @ref HAL_PLAY_LUT1_OUT_REGISTERED :    The flag of LUT1 registered output
  *                                 @arg @ref HAL_PLAY_LUT2_OUT_REGISTERED :    The flag of LUT2 registered output
  *                                 @arg @ref HAL_PLAY_LUT3_OUT_REGISTERED :    The flag of LUT3 registered output
  *                                 @arg @ref HAL_PLAY_LUT4_OUT_REGISTERED :    The flag of LUT4 registered output
  *                                 @arg @ref HAL_PLAY_LUT5_OUT_REGISTERED :    The flag of LUT5 registered output
  *                                 @arg @ref HAL_PLAY_LUT6_OUT_REGISTERED :    The flag of LUT6 registered output
  *                                 @arg @ref HAL_PLAY_LUT7_OUT_REGISTERED :    The flag of LUT7 registered output
  *                                 @arg @ref HAL_PLAY_LUT8_OUT_REGISTERED :    The flag of LUT8 registered output
  *                                 @arg @ref HAL_PLAY_LUT9_OUT_REGISTERED :    The flag of LUT9 registered output
  *                                 @arg @ref HAL_PLAY_LUT10_OUT_REGISTERED :   The flag of LUT10 registered output
  *                                 @arg @ref HAL_PLAY_LUT11_OUT_REGISTERED :   The flag of LUT11 registered output
  *                                 @arg @ref HAL_PLAY_LUT12_OUT_REGISTERED :   The flag of LUT12 registered output
  *                                 @arg @ref HAL_PLAY_LUT13_OUT_REGISTERED :   The flag of LUT13 registered output
  *                                 @arg @ref HAL_PLAY_LUT14_OUT_REGISTERED :   The flag of LUT14 registered output
  *                                 @arg @ref HAL_PLAY_LUT15_OUT_REGISTERED :   The flag of LUT15 registered output
  *                                 @arg @ref HAL_PLAY_LUT_ALL_OUT_REGISTERED : All flags of LUTs registered outputs
  * @param  timeout_ms              Timeout duration (in ms).
  * @param  p_edge_trig_mask_status Pointer to return the triggered lookup table output flags.
  * @retval HAL_OK      Operation completed successfully.
  * @retval HAL_TIMEOUT Operation timed out.
  * @retval HAL_ERROR   Invalid parameter or wrong state.
  */
HAL_StatusTypeDef HAL_PLAY_LUT_PollForEdgeTrigger(HAL_PLAY_HandleTypeDef *hplay,
                                                  HAL_PLAY_PollingEdgeTriggerTypeDef poll_mode,
                                                  uint32_t edge_trig_mask, uint32_t *p_edge_trig_mask_status,
                                                  uint32_t timeout_ms)
{
  PLAY_TypeDef *p_playx;
  uint32_t tickstart;

  /* Check the parameters */
  if (hplay == NULL)
  {
    return HAL_ERROR;
  }

