zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/drivers/src/stm32h5xx_hal_play.c
  p_playx = PLAY_GET_INSTANCE(hplay);

  if (p_edge_trig_mask_status == NULL)
  {
    hplay->ErrorCode |= HAL_PLAY_ERROR_INVALID_PARAM;

    return HAL_ERROR;
  }

  assert_param(IS_PLAY_POLL_MODE(poll_mode));
  assert_param((edge_trig_mask != 0U));

  /* Check the peripheral state */
  if (hplay->State != HAL_PLAY_STATE_BUSY)
  {
    return HAL_ERROR;
  }

  /* Get the current tick value */
  tickstart = HAL_GetTick();

  /* Check selected event flag */
  *p_edge_trig_mask_status = 0U;
  do
  {
    /* Check if timeout is disabled (set to infinite wait) */
    if (timeout_ms != HAL_MAX_DELAY)
    {
      if (((HAL_GetTick() - tickstart) > timeout_ms) || (timeout_ms == 0U))
      {
        /* Before returning timeout, re-check if p_edge_trig_mask_status is still 0 */
        if (*p_edge_trig_mask_status == 0U)
        {
          return HAL_TIMEOUT;
        }
      }
    }

    uint32_t current_flag_status = LL_PLAY_LUT_GetFlags(p_playx) & edge_trig_mask;
    if (poll_mode == HAL_PLAY_POLLING_FOR_ANY_EDGE)
    {
      *p_edge_trig_mask_status = current_flag_status;
    }
    else
    {
      *p_edge_trig_mask_status = (((current_flag_status & edge_trig_mask) == edge_trig_mask) ?
                                  current_flag_status : 0U);
    }
  } while (*p_edge_trig_mask_status == 0U);

  /* Clear flags triggered */
  LL_PLAY_LUT_ClearFlag(p_playx, edge_trig_mask);

  return HAL_OK;
}

/**
  * @brief  Enable a set of lookup table output interrupts.
  * @param  hplay    Pointer to a @ref HAL_PLAY_HandleTypeDef.
  * @param  its_mask Mask of lookup table output interrupt to enable.
  *                  This parameter can be a combination of the following values:
  *                  @arg @ref HAL_PLAY_LUT0_OUT_DIRECT :        The interrupt of LUT0 direct output
  *                  @arg @ref HAL_PLAY_LUT1_OUT_DIRECT :        The interrupt of LUT1 direct output
  *                  @arg @ref HAL_PLAY_LUT2_OUT_DIRECT :        The interrupt of LUT2 direct output
  *                  @arg @ref HAL_PLAY_LUT3_OUT_DIRECT :        The interrupt of LUT3 direct output
  *                  @arg @ref HAL_PLAY_LUT4_OUT_DIRECT :        The interrupt of LUT4 direct output
  *                  @arg @ref HAL_PLAY_LUT5_OUT_DIRECT :        The interrupt of LUT5 direct output
  *                  @arg @ref HAL_PLAY_LUT6_OUT_DIRECT :        The interrupt of LUT6 direct output
  *                  @arg @ref HAL_PLAY_LUT7_OUT_DIRECT :        The interrupt of LUT7 direct output
  *                  @arg @ref HAL_PLAY_LUT8_OUT_DIRECT :        The interrupt of LUT8 direct output
  *                  @arg @ref HAL_PLAY_LUT9_OUT_DIRECT :        The interrupt of LUT9 direct output
  *                  @arg @ref HAL_PLAY_LUT10_OUT_DIRECT :       The interrupt of LUT10 direct output
  *                  @arg @ref HAL_PLAY_LUT11_OUT_DIRECT :       The interrupt of LUT11 direct output
  *                  @arg @ref HAL_PLAY_LUT12_OUT_DIRECT :       The interrupt of LUT12 direct output
  *                  @arg @ref HAL_PLAY_LUT13_OUT_DIRECT :       The interrupt of LUT13 direct output
  *                  @arg @ref HAL_PLAY_LUT14_OUT_DIRECT :       The interrupt of LUT14 direct output
  *                  @arg @ref HAL_PLAY_LUT15_OUT_DIRECT :       The interrupt of LUT15 direct output
  *                  @arg @ref HAL_PLAY_LUT_ALL_OUT_DIRECT :     All interrupts of LUTs direct outputs
  *                  @arg @ref HAL_PLAY_LUT0_OUT_REGISTERED :    The interrupt of LUT0 registered output
  *                  @arg @ref HAL_PLAY_LUT1_OUT_REGISTERED :    The interrupt of LUT1 registered output
  *                  @arg @ref HAL_PLAY_LUT2_OUT_REGISTERED :    The interrupt of LUT2 registered output
  *                  @arg @ref HAL_PLAY_LUT3_OUT_REGISTERED :    The interrupt of LUT3 registered output
  *                  @arg @ref HAL_PLAY_LUT4_OUT_REGISTERED :    The interrupt of LUT4 registered output
  *                  @arg @ref HAL_PLAY_LUT5_OUT_REGISTERED :    The interrupt of LUT5 registered output
  *                  @arg @ref HAL_PLAY_LUT6_OUT_REGISTERED :    The interrupt of LUT6 registered output
  *                  @arg @ref HAL_PLAY_LUT7_OUT_REGISTERED :    The interrupt of LUT7 registered output
  *                  @arg @ref HAL_PLAY_LUT8_OUT_REGISTERED :    The interrupt of LUT8 registered output
  *                  @arg @ref HAL_PLAY_LUT9_OUT_REGISTERED :    The interrupt of LUT9 registered output
  *                  @arg @ref HAL_PLAY_LUT10_OUT_REGISTERED :   The interrupt of LUT10 registered output
  *                  @arg @ref HAL_PLAY_LUT11_OUT_REGISTERED :   The interrupt of LUT11 registered output
  *                  @arg @ref HAL_PLAY_LUT12_OUT_REGISTERED :   The interrupt of LUT12 registered output
  *                  @arg @ref HAL_PLAY_LUT13_OUT_REGISTERED :   The interrupt of LUT13 registered output
  *                  @arg @ref HAL_PLAY_LUT14_OUT_REGISTERED :   The interrupt of LUT14 registered output
  *                  @arg @ref HAL_PLAY_LUT15_OUT_REGISTERED :   The interrupt of LUT15 registered output
  *                  @arg @ref HAL_PLAY_LUT_ALL_OUT_REGISTERED : All interrupts of LUTs registered outputs
  * @retval HAL_OK    Operation completed successfully.
  * @retval HAL_ERROR Invalid parameter or wrong state.
  */
HAL_StatusTypeDef HAL_PLAY_LUT_EnableIT(const HAL_PLAY_HandleTypeDef *hplay, uint32_t its_mask)
{
  /* Check the parameters */
  if (hplay == NULL)
  {
    return HAL_ERROR;
  }

  assert_param((its_mask != 0U));

  if (hplay->State != HAL_PLAY_STATE_BUSY)
  {
    return HAL_ERROR;
  }

  LL_PLAY_LUT_EnableIT(PLAY_GET_INSTANCE(hplay), its_mask);

  return HAL_OK;
}

/**
  * @brief  Disable a set of lookup table output Interrupts.
  * @param  hplay    Pointer to a @ref HAL_PLAY_HandleTypeDef.
  * @param  its_mask Mask of lookup table output interrupt to disable
  *                  This parameter can be a combination of the following values:
  *                  @arg @ref HAL_PLAY_LUT0_OUT_DIRECT :        The interrupt of LUT0 direct output
  *                  @arg @ref HAL_PLAY_LUT1_OUT_DIRECT :        The interrupt of LUT1 direct output
  *                  @arg @ref HAL_PLAY_LUT2_OUT_DIRECT :        The interrupt of LUT2 direct output
  *                  @arg @ref HAL_PLAY_LUT3_OUT_DIRECT :        The interrupt of LUT3 direct output
  *                  @arg @ref HAL_PLAY_LUT4_OUT_DIRECT :        The interrupt of LUT4 direct output
  *                  @arg @ref HAL_PLAY_LUT5_OUT_DIRECT :        The interrupt of LUT5 direct output
  *                  @arg @ref HAL_PLAY_LUT6_OUT_DIRECT :        The interrupt of LUT6 direct output
  *                  @arg @ref HAL_PLAY_LUT7_OUT_DIRECT :        The interrupt of LUT7 direct output
  *                  @arg @ref HAL_PLAY_LUT8_OUT_DIRECT :        The interrupt of LUT8 direct output
  *                  @arg @ref HAL_PLAY_LUT9_OUT_DIRECT :        The interrupt of LUT9 direct output
  *                  @arg @ref HAL_PLAY_LUT10_OUT_DIRECT :       The interrupt of LUT10 direct output
  *                  @arg @ref HAL_PLAY_LUT11_OUT_DIRECT :       The interrupt of LUT11 direct output
  *                  @arg @ref HAL_PLAY_LUT12_OUT_DIRECT :       The interrupt of LUT12 direct output
  *                  @arg @ref HAL_PLAY_LUT13_OUT_DIRECT :       The interrupt of LUT13 direct output
  *                  @arg @ref HAL_PLAY_LUT14_OUT_DIRECT :       The interrupt of LUT14 direct output
  *                  @arg @ref HAL_PLAY_LUT15_OUT_DIRECT :       The interrupt of LUT15 direct output
  *                  @arg @ref HAL_PLAY_LUT_ALL_OUT_DIRECT :     All interrupts of LUTs direct outputs
  *                  @arg @ref HAL_PLAY_LUT0_OUT_REGISTERED :    The interrupt of LUT0 registered output
  *                  @arg @ref HAL_PLAY_LUT1_OUT_REGISTERED :    The interrupt of LUT1 registered output
  *                  @arg @ref HAL_PLAY_LUT2_OUT_REGISTERED :    The interrupt of LUT2 registered output
  *                  @arg @ref HAL_PLAY_LUT3_OUT_REGISTERED :    The interrupt of LUT3 registered output
  *                  @arg @ref HAL_PLAY_LUT4_OUT_REGISTERED :    The interrupt of LUT4 registered output
  *                  @arg @ref HAL_PLAY_LUT5_OUT_REGISTERED :    The interrupt of LUT5 registered output
  *                  @arg @ref HAL_PLAY_LUT6_OUT_REGISTERED :    The interrupt of LUT6 registered output
  *                  @arg @ref HAL_PLAY_LUT7_OUT_REGISTERED :    The interrupt of LUT7 registered output
  *                  @arg @ref HAL_PLAY_LUT8_OUT_REGISTERED :    The interrupt of LUT8 registered output
  *                  @arg @ref HAL_PLAY_LUT9_OUT_REGISTERED :    The interrupt of LUT9 registered output
  *                  @arg @ref HAL_PLAY_LUT10_OUT_REGISTERED :   The interrupt of LUT10 registered output
  *                  @arg @ref HAL_PLAY_LUT11_OUT_REGISTERED :   The interrupt of LUT11 registered output
  *                  @arg @ref HAL_PLAY_LUT12_OUT_REGISTERED :   The interrupt of LUT12 registered output
  *                  @arg @ref HAL_PLAY_LUT13_OUT_REGISTERED :   The interrupt of LUT13 registered output
  *                  @arg @ref HAL_PLAY_LUT14_OUT_REGISTERED :   The interrupt of LUT14 registered output
  *                  @arg @ref HAL_PLAY_LUT15_OUT_REGISTERED :   The interrupt of LUT15 registered output
  *                  @arg @ref HAL_PLAY_LUT_ALL_OUT_REGISTERED : All interrupts of LUTs registered outputs
  * @retval HAL_OK    Operation completed successfully.
  * @retval HAL_ERROR Invalid parameter or wrong state.
  */
HAL_StatusTypeDef HAL_PLAY_LUT_DisableIT(const HAL_PLAY_HandleTypeDef *hplay, uint32_t its_mask)
{
  /* Check the parameters */
  if (hplay == NULL)
  {
    return HAL_ERROR;
  }

