zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/drivers/src/stm32h5xx_hal_play.c
  assert_param((its_mask != 0U));

  if (hplay->State != HAL_PLAY_STATE_BUSY)
  {
    return HAL_ERROR;
  }

  LL_PLAY_LUT_DisableIT(PLAY_GET_INSTANCE(hplay), its_mask);

  return HAL_OK;
}

/**
  * @brief  Get the enabled lookup table output interrupts.
  * @param  hplay Pointer to a @ref HAL_PLAY_HandleTypeDef.
  * @return Mask of enabled lookup table output interrupts.
  *         This returned parameter can be a combination of the following values:
  *         @arg @ref HAL_PLAY_LUT0_OUT_DIRECT :      The interrupt of LUT0 direct output
  *         @arg @ref HAL_PLAY_LUT1_OUT_DIRECT :      The interrupt of LUT1 direct output
  *         @arg @ref HAL_PLAY_LUT2_OUT_DIRECT :      The interrupt of LUT2 direct output
  *         @arg @ref HAL_PLAY_LUT3_OUT_DIRECT :      The interrupt of LUT3 direct output
  *         @arg @ref HAL_PLAY_LUT4_OUT_DIRECT :      The interrupt of LUT4 direct output
  *         @arg @ref HAL_PLAY_LUT5_OUT_DIRECT :      The interrupt of LUT5 direct output
  *         @arg @ref HAL_PLAY_LUT6_OUT_DIRECT :      The interrupt of LUT6 direct output
  *         @arg @ref HAL_PLAY_LUT7_OUT_DIRECT :      The interrupt of LUT7 direct output
  *         @arg @ref HAL_PLAY_LUT8_OUT_DIRECT :      The interrupt of LUT8 direct output
  *         @arg @ref HAL_PLAY_LUT9_OUT_DIRECT :      The interrupt of LUT9 direct output
  *         @arg @ref HAL_PLAY_LUT10_OUT_DIRECT :     The interrupt of LUT10 direct output
  *         @arg @ref HAL_PLAY_LUT11_OUT_DIRECT :     The interrupt of LUT11 direct output
  *         @arg @ref HAL_PLAY_LUT12_OUT_DIRECT :     The interrupt of LUT12 direct output
  *         @arg @ref HAL_PLAY_LUT13_OUT_DIRECT :     The interrupt of LUT13 direct output
  *         @arg @ref HAL_PLAY_LUT14_OUT_DIRECT :     The interrupt of LUT14 direct output
  *         @arg @ref HAL_PLAY_LUT15_OUT_DIRECT :     The interrupt of LUT15 direct output
  *         @arg @ref HAL_PLAY_LUT0_OUT_REGISTERED :  The interrupt of LUT0 registered output
  *         @arg @ref HAL_PLAY_LUT1_OUT_REGISTERED :  The interrupt of LUT1 registered output
  *         @arg @ref HAL_PLAY_LUT2_OUT_REGISTERED :  The interrupt of LUT2 registered output
  *         @arg @ref HAL_PLAY_LUT3_OUT_REGISTERED :  The interrupt of LUT3 registered output
  *         @arg @ref HAL_PLAY_LUT4_OUT_REGISTERED :  The interrupt of LUT4 registered output
  *         @arg @ref HAL_PLAY_LUT5_OUT_REGISTERED :  The interrupt of LUT5 registered output
  *         @arg @ref HAL_PLAY_LUT6_OUT_REGISTERED :  The interrupt of LUT6 registered output
  *         @arg @ref HAL_PLAY_LUT7_OUT_REGISTERED :  The interrupt of LUT7 registered output
  *         @arg @ref HAL_PLAY_LUT8_OUT_REGISTERED :  The interrupt of LUT8 registered output
  *         @arg @ref HAL_PLAY_LUT9_OUT_REGISTERED :  The interrupt of LUT9 registered output
  *         @arg @ref HAL_PLAY_LUT10_OUT_REGISTERED : The interrupt of LUT10 registered output
  *         @arg @ref HAL_PLAY_LUT11_OUT_REGISTERED : The interrupt of LUT11 registered output
  *         @arg @ref HAL_PLAY_LUT12_OUT_REGISTERED : The interrupt of LUT12 registered output
  *         @arg @ref HAL_PLAY_LUT13_OUT_REGISTERED : The interrupt of LUT13 registered output
  *         @arg @ref HAL_PLAY_LUT14_OUT_REGISTERED : The interrupt of LUT14 registered output
  *         @arg @ref HAL_PLAY_LUT15_OUT_REGISTERED : The interrupt of LUT15 registered output
  */
uint32_t HAL_PLAY_LUT_GetIT(const HAL_PLAY_HandleTypeDef *hplay)
{
  /* Check the parameters */
  if (hplay == NULL)
  {
    return 0U;
  }

  return LL_PLAY_LUT_GetIT(PLAY_GET_INSTANCE(hplay));
}

/**
  * @}
  */

/** @addtogroup PLAY_Exported_Functions_Group5
  * @{
A set of functions allowing to manage the Software Triggers:
- HAL_PLAY_WriteSWTrigger()
- HAL_PLAY_WriteSWTrigger_IT()
- HAL_PLAY_ToggleSWTrigger()
- HAL_PLAY_ToggleSWTrigger_IT()
- HAL_PLAY_ReadSWTrigger()
  */

/**
  * @brief  Set the Software Trigger states in polling mode.
  * @param  hplay       Pointer to a @ref HAL_PLAY_HandleTypeDef.
  * @param  sw_triggers Mask of Software Trigger.
  *                     This parameter can be a combination of the following values:
  *                     @arg @ref HAL_PLAY_SWTRIG0 :    Software trigger 0
  *                     @arg @ref HAL_PLAY_SWTRIG1 :    Software trigger 1
  *                     @arg @ref HAL_PLAY_SWTRIG2 :    Software trigger 2
  *                     @arg @ref HAL_PLAY_SWTRIG3 :    Software trigger 3
  *                     @arg @ref HAL_PLAY_SWTRIG4 :    Software trigger 4
  *                     @arg @ref HAL_PLAY_SWTRIG5 :    Software trigger 5
  *                     @arg @ref HAL_PLAY_SWTRIG6 :    Software trigger 6
  *                     @arg @ref HAL_PLAY_SWTRIG7 :    Software trigger 7
  *                     @arg @ref HAL_PLAY_SWTRIG8 :    Software trigger 8
  *                     @arg @ref HAL_PLAY_SWTRIG9 :    Software trigger 9
  *                     @arg @ref HAL_PLAY_SWTRIG10 :   Software trigger 10
  *                     @arg @ref HAL_PLAY_SWTRIG11 :   Software trigger 11
  *                     @arg @ref HAL_PLAY_SWTRIG12 :   Software trigger 12
  *                     @arg @ref HAL_PLAY_SWTRIG13 :   Software trigger 13
  *                     @arg @ref HAL_PLAY_SWTRIG14 :   Software trigger 14
  *                     @arg @ref HAL_PLAY_SWTRIG15 :   Software trigger 15
  *                     @arg @ref HAL_PLAY_SWTRIG_ALL : All software triggers
  * @param  state       State to set of type @ref HAL_PLAY_SWTriggerStateTypeDef.
  * @param  timeout_ms  Timeout duration (in ms).
  * @retval HAL_OK      Operation completed successfully.
  * @retval HAL_BUSY    A write is pending.
  * @retval HAL_TIMEOUT Timeout reached.
  * @retval HAL_ERROR   Invalid parameter or wrong state.
  */
HAL_StatusTypeDef HAL_PLAY_WriteSWTrigger(const HAL_PLAY_HandleTypeDef *hplay, uint32_t sw_triggers,
                                          HAL_PLAY_SWTriggerStateTypeDef state, uint32_t timeout_ms)
{
  PLAY_TypeDef *p_playx;

  /* Check the parameters */
  if (hplay == NULL)
  {
    return HAL_ERROR;
  }

