zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/drivers/src/stm32h5xx_hal_play.c
  p_playx = PLAY_GET_INSTANCE(hplay);

  assert_param(IS_PLAY_SWTRIGGER_MSK(sw_triggers));
  assert_param(IS_PLAY_SWTRIGGER_STATE(state));

  if (hplay->State != HAL_PLAY_STATE_BUSY)
  {
    return HAL_ERROR;
  }

  /* Check if a write access is available */
  if (LL_PLAY_IsSWTriggerWriteBusy(p_playx) != 0U)
  {
    return HAL_BUSY;
  }

  /* Set selected Software Triggers */
  if (state == HAL_PLAY_SW_TRIGGER_RESET)
  {
    LL_PLAY_ResetSWTrigger(p_playx, sw_triggers);
  }
  else
  {
    LL_PLAY_SetSWTrigger(p_playx, sw_triggers);
  }

  /* Wait until the write is completed */
  /* The Software Trigger write complete flag cannot be checked here because it is available only in interrupt mode */
  uint32_t tick_start = HAL_GetTick();
  while (LL_PLAY_IsSWTriggerWriteBusy(p_playx) != 0U)
  {
    if (timeout_ms != HAL_MAX_DELAY)
    {
      if (((HAL_GetTick() - tick_start) > timeout_ms) || (timeout_ms == 0U))
      {
        /* Before returning timeout, re-check if the flag has cleared */
        if (LL_PLAY_IsSWTriggerWriteBusy(p_playx) != 0U)
        {
          return HAL_TIMEOUT;
        }
      }
    }
  }

  return HAL_OK;
}

/**
  * @brief  Set the Software Trigger states in interrupt Mode.
  * @param  hplay       Pointer to a @ref HAL_PLAY_HandleTypeDef.
  * @param  sw_triggers Mask of Software Triggers.
  *                     This parameter can be a combination of the following values:
  *                     @arg @ref HAL_PLAY_SWTRIG0 :    Software trigger 0
  *                     @arg @ref HAL_PLAY_SWTRIG1 :    Software trigger 1
  *                     @arg @ref HAL_PLAY_SWTRIG2 :    Software trigger 2
  *                     @arg @ref HAL_PLAY_SWTRIG3 :    Software trigger 3
  *                     @arg @ref HAL_PLAY_SWTRIG4 :    Software trigger 4
  *                     @arg @ref HAL_PLAY_SWTRIG5 :    Software trigger 5
  *                     @arg @ref HAL_PLAY_SWTRIG6 :    Software trigger 6
  *                     @arg @ref HAL_PLAY_SWTRIG7 :    Software trigger 7
  *                     @arg @ref HAL_PLAY_SWTRIG8 :    Software trigger 8
  *                     @arg @ref HAL_PLAY_SWTRIG9 :    Software trigger 9
  *                     @arg @ref HAL_PLAY_SWTRIG10 :   Software trigger 10
  *                     @arg @ref HAL_PLAY_SWTRIG11 :   Software trigger 11
  *                     @arg @ref HAL_PLAY_SWTRIG12 :   Software trigger 12
  *                     @arg @ref HAL_PLAY_SWTRIG13 :   Software trigger 13
  *                     @arg @ref HAL_PLAY_SWTRIG14 :   Software trigger 14
  *                     @arg @ref HAL_PLAY_SWTRIG15 :   Software trigger 15
  *                     @arg @ref HAL_PLAY_SWTRIG_ALL : All software triggers
  * @param  state       State to set of type @ref HAL_PLAY_SWTriggerStateTypeDef.
  * @retval HAL_OK      Operation completed successfully.
  * @retval HAL_BUSY    A write is pending.
  * @retval HAL_ERROR   Invalid parameter or wrong state.
  */
HAL_StatusTypeDef HAL_PLAY_WriteSWTrigger_IT(const HAL_PLAY_HandleTypeDef *hplay, uint32_t sw_triggers,
                                             HAL_PLAY_SWTriggerStateTypeDef state)
{
  PLAY_TypeDef *p_playx;

  /* Check the parameters */
  if (hplay == NULL)
  {
    return HAL_ERROR;
  }

  p_playx = PLAY_GET_INSTANCE(hplay);

  assert_param(IS_PLAY_SWTRIGGER_MSK(sw_triggers));
  assert_param(IS_PLAY_SWTRIGGER_STATE(state));

  if (hplay->State != HAL_PLAY_STATE_BUSY)
  {
    return HAL_ERROR;
  }

  /* Check if a write access is available */
  if (LL_PLAY_IsSWTriggerWriteBusy(p_playx) != 0U)
  {
    return HAL_BUSY;
  }

  /* Enable Software Trigger write complete interrupt */
  LL_PLAY_EnableIT_SWTriggerWriteComplete(p_playx);

  /* Set selected Software Triggers */
  if (state == HAL_PLAY_SW_TRIGGER_RESET)
  {
    LL_PLAY_ResetSWTrigger(p_playx, sw_triggers);
  }
  else
  {
    LL_PLAY_SetSWTrigger(p_playx, sw_triggers);
  }

  return HAL_OK;
}

/**
  * @brief  Toggle the Software Trigger State in polling mode.
  * @param  hplay       Pointer to a @ref HAL_PLAY_HandleTypeDef.
  * @param  sw_triggers Mask of Software Triggers.
  *                     This parameter can be a combination of the following values:
  *                     @arg @ref HAL_PLAY_SWTRIG0 :    Software trigger 0
  *                     @arg @ref HAL_PLAY_SWTRIG1 :    Software trigger 1
  *                     @arg @ref HAL_PLAY_SWTRIG2 :    Software trigger 2
  *                     @arg @ref HAL_PLAY_SWTRIG3 :    Software trigger 3
  *                     @arg @ref HAL_PLAY_SWTRIG4 :    Software trigger 4
  *                     @arg @ref HAL_PLAY_SWTRIG5 :    Software trigger 5
  *                     @arg @ref HAL_PLAY_SWTRIG6 :    Software trigger 6
  *                     @arg @ref HAL_PLAY_SWTRIG7 :    Software trigger 7
  *                     @arg @ref HAL_PLAY_SWTRIG8 :    Software trigger 8
  *                     @arg @ref HAL_PLAY_SWTRIG9 :    Software trigger 9
  *                     @arg @ref HAL_PLAY_SWTRIG10 :   Software trigger 10
  *                     @arg @ref HAL_PLAY_SWTRIG11 :   Software trigger 11
  *                     @arg @ref HAL_PLAY_SWTRIG12 :   Software trigger 12
  *                     @arg @ref HAL_PLAY_SWTRIG13 :   Software trigger 13
  *                     @arg @ref HAL_PLAY_SWTRIG14 :   Software trigger 14
  *                     @arg @ref HAL_PLAY_SWTRIG15 :   Software trigger 15
  *                     @arg @ref HAL_PLAY_SWTRIG_ALL : All software triggers
  * @param  timeout_ms  Timeout duration (in ms).
  * @retval HAL_OK      Operation completed successfully.
  * @retval HAL_BUSY    A write is pending.
  * @retval HAL_TIMEOUT Timeout reached.
  * @retval HAL_ERROR   Invalid parameter or wrong state.
  */
HAL_StatusTypeDef HAL_PLAY_ToggleSWTrigger(const HAL_PLAY_HandleTypeDef *hplay, uint32_t sw_triggers,
                                           uint32_t timeout_ms)
{
  PLAY_TypeDef *p_playx;

  /* Check the parameters */
  if (hplay == NULL)
  {
    return HAL_ERROR;
  }

