zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/drivers/src/stm32h5xx_hal_play.c
  p_playx = PLAY_GET_INSTANCE(hplay);

  assert_param(IS_PLAY_SWTRIGGER_MSK(sw_triggers));

  if (hplay->State != HAL_PLAY_STATE_BUSY)
  {
    return HAL_ERROR;
  }

  /* Check if a write access is available */
  if (LL_PLAY_IsSWTriggerWriteBusy(p_playx) != 0U)
  {
    return HAL_BUSY;
  }

  /* Toggle the selected Software Triggers */
  LL_PLAY_ToggleSWTrigger(p_playx, sw_triggers);

  /* Wait until the write is completed */
  /* The Software Trigger write complete flag cannot be checked here because it is available only in interrupt mode */
  uint32_t tick_start = HAL_GetTick();
  while (LL_PLAY_IsSWTriggerWriteBusy(p_playx) != 0U)
  {
    if (timeout_ms != HAL_MAX_DELAY)
    {
      if (((HAL_GetTick() - tick_start) > timeout_ms) || (timeout_ms == 0U))
      {
        /* Before returning timeout, re-check if the flag has cleared */
        if (LL_PLAY_IsSWTriggerWriteBusy(p_playx) != 0U)
        {
          return HAL_TIMEOUT;
        }
      }
    }
  }

  return HAL_OK;
}

/**
  * @brief  Toggle the Software Trigger State in interrupt Mode.
  * @param  hplay       Pointer to a @ref HAL_PLAY_HandleTypeDef.
  * @param  sw_triggers Mask of Software Triggers.
  *                     This parameter can be a combination of the following values:
  *                     @arg @ref HAL_PLAY_SWTRIG0 :    Software trigger 0
  *                     @arg @ref HAL_PLAY_SWTRIG1 :    Software trigger 1
  *                     @arg @ref HAL_PLAY_SWTRIG2 :    Software trigger 2
  *                     @arg @ref HAL_PLAY_SWTRIG3 :    Software trigger 3
  *                     @arg @ref HAL_PLAY_SWTRIG4 :    Software trigger 4
  *                     @arg @ref HAL_PLAY_SWTRIG5 :    Software trigger 5
  *                     @arg @ref HAL_PLAY_SWTRIG6 :    Software trigger 6
  *                     @arg @ref HAL_PLAY_SWTRIG7 :    Software trigger 7
  *                     @arg @ref HAL_PLAY_SWTRIG8 :    Software trigger 8
  *                     @arg @ref HAL_PLAY_SWTRIG9 :    Software trigger 9
  *                     @arg @ref HAL_PLAY_SWTRIG10 :   Software trigger 10
  *                     @arg @ref HAL_PLAY_SWTRIG11 :   Software trigger 11
  *                     @arg @ref HAL_PLAY_SWTRIG12 :   Software trigger 12
  *                     @arg @ref HAL_PLAY_SWTRIG13 :   Software trigger 13
  *                     @arg @ref HAL_PLAY_SWTRIG14 :   Software trigger 14
  *                     @arg @ref HAL_PLAY_SWTRIG15 :   Software trigger 15
  *                     @arg @ref HAL_PLAY_SWTRIG_ALL : All software triggers
  * @retval HAL_OK      Operation completed successfully.
  * @retval HAL_BUSY    A write is pending.
  * @retval HAL_ERROR   Invalid parameter or wrong state.
  */
HAL_StatusTypeDef HAL_PLAY_ToggleSWTrigger_IT(const HAL_PLAY_HandleTypeDef *hplay, uint32_t sw_triggers)
{
  PLAY_TypeDef *p_playx;

  /* Check the parameters */
  if (hplay == NULL)
  {
    return HAL_ERROR;
  }

  p_playx = PLAY_GET_INSTANCE(hplay);

  assert_param(IS_PLAY_SWTRIGGER_MSK(sw_triggers));

  if (hplay->State != HAL_PLAY_STATE_BUSY)
  {
    return HAL_ERROR;
  }

  /* Check if a write access is available */
  if (LL_PLAY_IsSWTriggerWriteBusy(p_playx) != 0U)
  {
    return HAL_BUSY;
  }

  LL_PLAY_EnableIT_SWTriggerWriteComplete(p_playx);

  LL_PLAY_ToggleSWTrigger(p_playx, sw_triggers);

  return HAL_OK;
}

/**
  * @brief  Read the State of a Software Trigger.
  * @param  hplay   Pointer to a @ref HAL_PLAY_HandleTypeDef.
  * @param  sw_trig Software Trigger.
  *                 This parameter can be one of the following values:
  *                 @arg @ref HAL_PLAY_SWTRIG0 :  Software trigger 0
  *                 @arg @ref HAL_PLAY_SWTRIG1 :  Software trigger 1
  *                 @arg @ref HAL_PLAY_SWTRIG2 :  Software trigger 2
  *                 @arg @ref HAL_PLAY_SWTRIG3 :  Software trigger 3
  *                 @arg @ref HAL_PLAY_SWTRIG4 :  Software trigger 4
  *                 @arg @ref HAL_PLAY_SWTRIG5 :  Software trigger 5
  *                 @arg @ref HAL_PLAY_SWTRIG6 :  Software trigger 6
  *                 @arg @ref HAL_PLAY_SWTRIG7 :  Software trigger 7
  *                 @arg @ref HAL_PLAY_SWTRIG8 :  Software trigger 8
  *                 @arg @ref HAL_PLAY_SWTRIG9 :  Software trigger 9
  *                 @arg @ref HAL_PLAY_SWTRIG10 : Software trigger 10
  *                 @arg @ref HAL_PLAY_SWTRIG11 : Software trigger 11
  *                 @arg @ref HAL_PLAY_SWTRIG12 : Software trigger 12
  *                 @arg @ref HAL_PLAY_SWTRIG13 : Software trigger 13
  *                 @arg @ref HAL_PLAY_SWTRIG14 : Software trigger 14
  *                 @arg @ref HAL_PLAY_SWTRIG15 : Software trigger 15
  * @note   This function will return @ref HAL_PLAY_SW_TRIGGER_RESET in case of wrong parameter.
  * @return State of Software Trigger.
  */
HAL_PLAY_SWTriggerStateTypeDef HAL_PLAY_ReadSWTrigger(const HAL_PLAY_HandleTypeDef *hplay, uint32_t sw_trig)
{
  /* Check the parameters */
  if (hplay == NULL)
  {
    return HAL_PLAY_SW_TRIGGER_RESET;
  }

  assert_param(IS_PLAY_SWTRIGGER(sw_trig));

  /* Read the SW Trigger values */
  return ((LL_PLAY_IsSWTriggerSet(PLAY_GET_INSTANCE(hplay), sw_trig) != 0U)
          ? HAL_PLAY_SW_TRIGGER_SET : HAL_PLAY_SW_TRIGGER_RESET);
}

/**
  * @}
  */

/** @addtogroup PLAY_Exported_Functions_Group6
  * @{
A set of functions allowing to handle the PLAY interrupts in asynchronous mode.

- IRQ handler:
  - HAL_PLAY_IRQHandler()

- Callback functions:
  - Depending on the process function used, different callbacks might be triggered:

  | Process API \n \ \n Callbacks           | HAL_PLAY_WriteSWTrigger_IT() | HAL_PLAY_ToggleSWTrigger_IT() |
  |-----------------------------------------|:----------------------------:|:-----------------------------:|
  | HAL_PLAY_SWTriggerWriteCpltCallback()   |               x              |              x                |

  | Process API \n \ \n Callbacks           | HAL_PLAY_LUT_SetEdgeTrigger_IT() |
  |-----------------------------------------|:--------------------------------:|
  | HAL_PLAY_EdgeTriggerWriteCpltCallback() |                 x                |

- Additionally, the following callbacks are available for lookup table output flags if interrupts were enabled
  with @ref HAL_PLAY_LUT_EnableIT():
  - HAL_PLAY_LUTOutputRisingCallback(): When one of the lookup table output flags is triggered on a rising edge.
  - HAL_PLAY_LUTOutputFallingCallback(): When one of the lookup table output flags is triggered on a falling edge.

