zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/drivers/src/stm32h5xx_hal_play.c
- Callback registering functions:
  - HAL_PLAY_RegisterCallback()
  - HAL_PLAY_RegisterLUTOutputCallback()
  - HAL_PLAY_UnRegisterCallback()
  - HAL_PLAY_UnRegisterLUTOutputCallback()
  */

/**
  * @brief Handle PLAY interrupt request.
  * @param hplay  Pointer to a @ref HAL_PLAY_HandleTypeDef.
  */
void HAL_PLAY_IRQHandler(HAL_PLAY_HandleTypeDef *hplay)
{
  PLAY_TypeDef *p_playx;

  p_playx = PLAY_GET_INSTANCE(hplay);

  /* Get status of general interrupts */
  uint32_t reg_ier = LL_PLAY_READ_REG(p_playx, IER);
  uint32_t reg_isr = LL_PLAY_READ_REG(p_playx, ISR);
  uint32_t reg_misr = reg_ier & reg_isr;

  /**
    * Retrieve the status of lookup table output interrupts.
    * Reading only the ISR_FLAGS is not sufficient to indicate that an interrupt has occurred.
    * If the interrupt for a lookup table output is disabled and the flag is set,
    * the IRQ handler does not recognize it as the source of the interrupt.
    * To avoid this situation, a logical AND operation is performed between the FLIER and
    * FLSTAT registers to identify the actual interrupt flags.
    */
  uint32_t reg_flier = LL_PLAY_LUT_GetIT(p_playx);
  uint32_t reg_flstat = LL_PLAY_LUT_GetFlags(p_playx);
  uint32_t reg_flmisr = reg_flier & reg_flstat;

  /* Check SWTrigger write complete interrupt */
  if (IS_PLAY_BIT_SET(reg_misr, PLAY_IT_STATUS_SW_TRIGGER_WRITE_COMPLETE))
  {
    LL_PLAY_ClearFlag_SWTriggerWriteComplete(p_playx);

    LL_PLAY_DisableIT_SWTriggerWriteComplete(p_playx);

    /* Call the callback */
#if (USE_HAL_PLAY_REGISTER_CALLBACKS == 1)
    hplay->SWTriggerWriteCpltCallback(hplay);
#else
    HAL_PLAY_SWTriggerWriteCpltCallback(hplay);
#endif /* USE_HAL_PLAY_REGISTER_CALLBACKS */
  }

  /* Check Edge Trigger write complete interrupt */
  if (IS_PLAY_BIT_SET(reg_misr, PLAY_IT_STATUS_EDGE_TRIGGER_WRITE_COMPLETE))
  {
    LL_PLAY_LUT_ClearFlag_EdgeTriggerWriteComplete(p_playx);

    LL_PLAY_LUT_DisableIT_EdgeTriggerWriteComplete(p_playx);

    /* Call the callback */
#if (USE_HAL_PLAY_REGISTER_CALLBACKS == 1)
    hplay->EdgeTriggerWriteCpltCallback(hplay);
#else
    HAL_PLAY_EdgeTriggerWriteCpltCallback(hplay);
#endif /* USE_HAL_PLAY_REGISTER_CALLBACKS */
  }

  /* Check lookup table output interrupts */
  if (reg_flmisr > 0U)
  {
    LL_PLAY_LUT_ClearFlag(p_playx, reg_flmisr);

    /* Extract the status of Flags on rising and falling edges */
    uint32_t reg_edgetrig = LL_PLAY_LUT_GetEdgeTrigger(p_playx);
    uint32_t mask_flag_rising = reg_flmisr & reg_edgetrig;
    uint32_t mask_flag_falling = reg_flmisr & (~reg_edgetrig);

    if (mask_flag_rising > 0U)
    {
#if (USE_HAL_PLAY_REGISTER_CALLBACKS == 1)
      hplay->LUTOutputRisingCallback(hplay, mask_flag_rising);
#else
      HAL_PLAY_LUTOutputRisingCallback(hplay, mask_flag_rising);
#endif /* USE_HAL_PLAY_REGISTER_CALLBACKS */
    }

    if (mask_flag_falling > 0U)
    {
#if (USE_HAL_PLAY_REGISTER_CALLBACKS == 1)
      hplay->LUTOutputFallingCallback(hplay, mask_flag_falling);
#else
      HAL_PLAY_LUTOutputFallingCallback(hplay, mask_flag_falling);
#endif /* USE_HAL_PLAY_REGISTER_CALLBACKS */
    }

  }
}

/**
  * @brief   Callback for Software Trigger write complete.
  * @param   hplay Pointer to a @ref HAL_PLAY_HandleTypeDef.
  * @warning This weak function must not be modified. When the callback is needed,
  *          it must be implemented in the user file.
  */
__weak void HAL_PLAY_SWTriggerWriteCpltCallback(HAL_PLAY_HandleTypeDef *hplay)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hplay);

  /* WARNING: This function must not be modified. When the callback is needed,
              function HAL_PLAY_SWTriggerWriteCpltCallback() must be implemented in the user file.
   */
}

/**
  * @brief   Callback for Edge Trigger write complete.
  * @param   hplay Pointer to a @ref HAL_PLAY_HandleTypeDef.
  * @warning This weak function must not be modified. When the callback is needed,
  *          it must be implemented in the user file.
  */
__weak void HAL_PLAY_EdgeTriggerWriteCpltCallback(HAL_PLAY_HandleTypeDef *hplay)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hplay);

  /* WARNING: This function must not be modified. When the callback is needed,
              function HAL_PLAY_EdgeTriggerWriteCpltCallback() must be implemented in the user file.
   */
}

/**
  * @brief   Callback for lookup table output rising edge.
  * @param   hplay                 Pointer to a @ref HAL_PLAY_HandleTypeDef.
  * @param   edge_trig_mask_status Mask of lookup table output triggered on a rising edge.
  * @warning This weak function must not be modified. When the callback is needed,
  *          it must be implemented in the user file.
  */
__weak void HAL_PLAY_LUTOutputRisingCallback(HAL_PLAY_HandleTypeDef *hplay, uint32_t edge_trig_mask_status)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hplay);
  UNUSED(edge_trig_mask_status);

  /* WARNING: This function must not be modified. When the callback is needed,
              function HAL_PLAY_LUTOutputRisingCallback() must be implemented in the user file.
   */
}

/**
  * @brief   Callback for lookup table output falling edge.
  * @param   hplay                 Pointer to a @ref HAL_PLAY_HandleTypeDef.
  * @param   edge_trig_mask_status Mask of lookup table output triggered on a falling edge
  * @warning This weak function must not be modified. When the callback is needed,
  *          it must be implemented in the user file.
  */
__weak void HAL_PLAY_LUTOutputFallingCallback(HAL_PLAY_HandleTypeDef *hplay, uint32_t edge_trig_mask_status)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hplay);
  UNUSED(edge_trig_mask_status);

  /* WARNING: This function must not be modified. When the callback is needed,
              function HAL_PLAY_LUTOutputFallingCallback() must be implemented in the user file.
   */
}

#if (USE_HAL_PLAY_REGISTER_CALLBACKS == 1)
/**
  * @brief  Register a user PLAY Callback.
  * @param  hplay      Pointer to a @ref HAL_PLAY_HandleTypeDef.
  * @param  CallbackID ID of the callback to be registered.
  *                    This parameter can be one of the following values:
  *                    @arg @ref HAL_PLAY_SW_TRIGGER_WRITE_CPLT_CB_ID SWIN Write Complete callback ID
  *                    @arg @ref HAL_PLAY_EDGE_TRIGGER_WRITE_CPLT_CB_ID Edge Trigger Write Complete callback ID
  *                    @arg @ref HAL_PLAY_MSPINIT_CB_ID MspInit callback ID
  *                    @arg @ref HAL_PLAY_MSPDEINIT_CB_ID MspDeInit callback ID
  * @param  pCallback  Pointer to the callback function.
  * @note   The HAL_PLAY_RegisterCallback() must be called before HAL_PLAY_Init() in @ref HAL_PLAY_STATE_RESET
  *         to register callbacks for @ref HAL_PLAY_MSPINIT_CB_ID and @ref HAL_PLAY_MSPDEINIT_CB_ID only.
  * @retval HAL_OK    Operation completed successfully.
  * @retval HAL_ERROR Invalid parameter.
  */
HAL_StatusTypeDef HAL_PLAY_RegisterCallback(HAL_PLAY_HandleTypeDef *hplay, HAL_PLAY_CallbackIDTypeDef CallbackID,
                                            pPLAY_CallbackTypeDef pCallback)
{
  HAL_StatusTypeDef status = HAL_OK;
  HAL_PLAY_StateTypeDef tmp_state;

  /* Check the parameters */
  if (hplay == NULL)
  {
    return HAL_ERROR;
  }

  if (pCallback == NULL)
  {
    hplay->ErrorCode |= HAL_PLAY_ERROR_INVALID_PARAM;

    return HAL_ERROR;
  }

  /* Check the peripheral state */
  tmp_state = hplay->State;
  if ((tmp_state == HAL_PLAY_STATE_INIT) || (tmp_state == HAL_PLAY_STATE_READY))
  {
    switch (CallbackID)
    {
      case HAL_PLAY_SW_TRIGGER_WRITE_CPLT_CB_ID:
        hplay->SWTriggerWriteCpltCallback = pCallback;
        break;

      case HAL_PLAY_EDGE_TRIGGER_WRITE_CPLT_CB_ID:
        hplay->EdgeTriggerWriteCpltCallback = pCallback;
        break;

