zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/drivers/src/stm32h5xx_hal_play.c
      case HAL_PLAY_MSPINIT_CB_ID:
        hplay->MspInitCallback = pCallback;
        break;

      case HAL_PLAY_MSPDEINIT_CB_ID:
        hplay->MspDeInitCallback = pCallback;
        break;

      default :
        hplay->ErrorCode |= HAL_PLAY_ERROR_INVALID_CALLBACK;

        status = HAL_ERROR;
        break;
    }
  }
  else if (tmp_state == HAL_PLAY_STATE_RESET)
  {
    switch (CallbackID)
    {
      case HAL_PLAY_MSPINIT_CB_ID:
        hplay->MspInitCallback = pCallback;
        break;

      case HAL_PLAY_MSPDEINIT_CB_ID:
        hplay->MspDeInitCallback = pCallback;
        break;

      default :
        hplay->ErrorCode |= HAL_PLAY_ERROR_INVALID_CALLBACK;

        status = HAL_ERROR;
        break;
    }
  }
  else
  {
    hplay->ErrorCode |= HAL_PLAY_ERROR_INVALID_CALLBACK;

    status = HAL_ERROR;
  }

  return status;
}

/**
  * @brief  Register a user PLAY LUT Output Callback.
  * @param  hplay      Pointer to a @ref HAL_PLAY_HandleTypeDef.
  * @param  CallbackID ID of the callback to be registered.
  *                    This parameter can be one of the following values:
  *                    @arg @ref HAL_PLAY_LUT_OUTPUT_RISING_CB_ID LUT output rising callback ID
  *                    @arg @ref HAL_PLAY_LUT_OUTPUT_FALLING_CB_ID LUT output falling callback ID
  * @param  pCallback  Pointer to the callback function.
  * @note   The user PLAY Callback is to be used instead of the weak predefined callback.
  * @retval HAL_OK    Operation completed successfully.
  * @retval HAL_ERROR Invalid parameter.
  */
HAL_StatusTypeDef HAL_PLAY_RegisterLUTOutputCallback(HAL_PLAY_HandleTypeDef *hplay,
                                                     HAL_PLAY_CallbackIDTypeDef CallbackID,
                                                     pPLAY_LUTOutputCallbackTypeDef pCallback)
{
  HAL_StatusTypeDef status = HAL_OK;
  HAL_PLAY_StateTypeDef tmp_state;

  /* Check the parameters */
  if (hplay == NULL)
  {
    return HAL_ERROR;
  }

  if (pCallback == NULL)
  {
    hplay->ErrorCode |= HAL_PLAY_ERROR_INVALID_PARAM;

    return HAL_ERROR;
  }

  /* Check the peripheral state */
  tmp_state = hplay->State;
  if ((tmp_state == HAL_PLAY_STATE_INIT) || (tmp_state == HAL_PLAY_STATE_READY))
  {
    switch (CallbackID)
    {
      case HAL_PLAY_LUT_OUTPUT_RISING_CB_ID:
        hplay->LUTOutputRisingCallback = pCallback;
        break;

      case HAL_PLAY_LUT_OUTPUT_FALLING_CB_ID:
        hplay->LUTOutputFallingCallback = pCallback;
        break;

      default :

        hplay->ErrorCode |= HAL_PLAY_ERROR_INVALID_CALLBACK;

        status = HAL_ERROR;
        break;
    }
  }
  else
  {

    hplay->ErrorCode |= HAL_PLAY_ERROR_INVALID_CALLBACK;

    status = HAL_ERROR;
  }

  return status;
}

/**
  * @brief  Unregister a user PLAY Callback. The PLAY callback will be redirected to the weak predefined callback.
  * @param  hplay       Pointer to a @ref HAL_PLAY_HandleTypeDef.
  * @param  CallbackID  ID of the callback to be unregistered
  *                     This parameter can be one of the following values:
  *                     @arg @ref HAL_PLAY_SW_TRIGGER_WRITE_CPLT_CB_ID SW trigger write complete callback ID
  *                     @arg @ref HAL_PLAY_EDGE_TRIGGER_WRITE_CPLT_CB_ID Edge trigger write complete callback ID
  *                     @arg @ref HAL_PLAY_MSPINIT_CB_ID MspInit callback ID
  *                     @arg @ref HAL_PLAY_MSPDEINIT_CB_ID MspDeInit callback ID
  * @note   The HAL_PLAY_UnRegisterCallback() can be called before HAL_PLAY_Init() in @ref HAL_PLAY_STATE_RESET
  *         to unregister callbacks for @ref HAL_PLAY_MSPINIT_CB_ID and @ref HAL_PLAY_MSPDEINIT_CB_ID only.
  * @retval HAL_OK    Operation completed successfully.
  * @retval HAL_ERROR Invalid parameter.
  */
HAL_StatusTypeDef HAL_PLAY_UnRegisterCallback(HAL_PLAY_HandleTypeDef *hplay, HAL_PLAY_CallbackIDTypeDef CallbackID)
{
  HAL_StatusTypeDef status = HAL_OK;
  HAL_PLAY_StateTypeDef tmp_state;

  /* Check the parameters */
  if (hplay == NULL)
  {
    return HAL_ERROR;
  }

  /* Check the peripheral state */
  tmp_state = hplay->State;
  if ((tmp_state == HAL_PLAY_STATE_INIT) || (tmp_state == HAL_PLAY_STATE_READY))
  {
    switch (CallbackID)
    {
      case HAL_PLAY_SW_TRIGGER_WRITE_CPLT_CB_ID:
        hplay->SWTriggerWriteCpltCallback = HAL_PLAY_SWTriggerWriteCpltCallback;
        break;

      case HAL_PLAY_EDGE_TRIGGER_WRITE_CPLT_CB_ID:
        hplay->EdgeTriggerWriteCpltCallback = HAL_PLAY_EdgeTriggerWriteCpltCallback;
        break;

      case HAL_PLAY_MSPINIT_CB_ID:
        hplay->MspInitCallback = HAL_PLAY_MspInit;      /* Legacy weak MspInit   */
        break;

      case HAL_PLAY_MSPDEINIT_CB_ID:
        hplay->MspDeInitCallback = HAL_PLAY_MspDeInit;  /* Legacy weak MspDeInit */
        break;

      default:
        /* Update the error code */
        hplay->ErrorCode |= HAL_PLAY_ERROR_INVALID_CALLBACK;
        status = HAL_ERROR;
        break;
    }
  }
  else if (tmp_state == HAL_PLAY_STATE_RESET)
  {
    switch (CallbackID)
    {
      case HAL_PLAY_MSPINIT_CB_ID:
        hplay->MspInitCallback = HAL_PLAY_MspInit;      /* Legacy weak MspInit   */
        break;

      case HAL_PLAY_MSPDEINIT_CB_ID:
        hplay->MspDeInitCallback = HAL_PLAY_MspDeInit;  /* Legacy weak MspDeInit */
        break;

      default:
        /* Update the error code */
        hplay->ErrorCode |= HAL_PLAY_ERROR_INVALID_CALLBACK;
        status = HAL_ERROR;
        break;
    }
  }
  else
  {
    hplay->ErrorCode |= HAL_PLAY_ERROR_INVALID_CALLBACK;
    status = HAL_ERROR;
  }

  return status;
}

/**
  * @brief  Unregister a user PLAY LUT Output Callback. The PLAY callback will be redirected to the weak
  *         predefined callback.
  * @param  hplay      Pointer to a @ref HAL_PLAY_HandleTypeDef.
  * @param  CallbackID ID of the callback to be unregistered
  *                    This parameter can be one of the following values:
  *                    @arg @ref HAL_PLAY_LUT_OUTPUT_RISING_CB_ID LUT output rising callback ID
  *                    @arg @ref HAL_PLAY_LUT_OUTPUT_FALLING_CB_ID LUT output falling callback ID
  * @retval HAL_OK    Operation completed successfully.
  * @retval HAL_ERROR Invalid parameter.
  */
HAL_StatusTypeDef HAL_PLAY_UnRegisterLUTOutputCallback(HAL_PLAY_HandleTypeDef *hplay,
                                                       HAL_PLAY_CallbackIDTypeDef CallbackID)
{
  HAL_StatusTypeDef status = HAL_OK;
  HAL_PLAY_StateTypeDef tmp_state;

  /* Check the parameters */
  if (hplay == NULL)
  {
    return HAL_ERROR;
  }

  /* Check the peripheral state */
  tmp_state = hplay->State;
  if ((tmp_state == HAL_PLAY_STATE_INIT) || (tmp_state == HAL_PLAY_STATE_READY))
  {
    switch (CallbackID)
    {
      case HAL_PLAY_LUT_OUTPUT_RISING_CB_ID:
        hplay->LUTOutputRisingCallback = HAL_PLAY_LUTOutputRisingCallback;
        break;

      case HAL_PLAY_LUT_OUTPUT_FALLING_CB_ID:
        hplay->LUTOutputFallingCallback = HAL_PLAY_LUTOutputFallingCallback;
        break;

      default :
        hplay->ErrorCode |= HAL_PLAY_ERROR_INVALID_CALLBACK;
        status = HAL_ERROR;
        break;
    }
  }
  else
  {
    hplay->ErrorCode |= HAL_PLAY_ERROR_INVALID_CALLBACK;
    status = HAL_ERROR;
  }

