zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/drivers/src/stm32h5xx_hal_play.c
  return status;
}

#endif /* USE_HAL_PLAY_REGISTER_CALLBACKS == 1 */
/**
  * @}
  */

/** @addtogroup PLAY_Exported_Functions_Group7
  * @{
A set of functions allowing to retrieve peripheral state and last process errors.
- HAL_PLAY_GetState() Return the PLAY handle state.
- HAL_PLAY_GetError() Returns errors limited to the last process.
  */
/**
  * @brief  Return the HAL PLAY handle state.
  * @param  hplay Pointer to a @ref HAL_PLAY_HandleTypeDef.
  * @note   This function will return @ref HAL_PLAY_STATE_RESET in case of wrong parameter.
  * @return Current PLAY state.
  */
HAL_PLAY_StateTypeDef HAL_PLAY_GetState(const HAL_PLAY_HandleTypeDef *hplay)
{
  if (hplay == NULL)
  {
    return HAL_PLAY_STATE_RESET;
  }

  return hplay->State;
}

/**
  * @brief  Get the HAL PLAY last error codes.
  * @param  hplay Pointer to a @ref HAL_PLAY_HandleTypeDef.
  * @note   This function will return 0 in case of wrong parameter.
  * @return PLAY Error Code. This value is a combination of @ref PLAY_Error_Codes values.
  */
uint32_t HAL_PLAY_GetError(const HAL_PLAY_HandleTypeDef *hplay)
{
  if (hplay == NULL)
  {
    return 0U;
  }

  return hplay->ErrorCode;
}

/**
  * @}
  */

/** @addtogroup PLAY_Exported_Functions_Group8
  * @{
A set of functions allowing to manage security and privileged access levels attributes:
 - HAL_PLAY_SetSecAttr() Set the security access level attribute.
 - HAL_PLAY_GetSecAttr() Get the security access level attribute.
 - HAL_PLAY_SetPrivAttr() Set the privileged access level attribute.
 - HAL_PLAY_GetPrivAttr() Get the privileged access level attribute.
  */

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
/**
  * @brief  Set the security access level attribute for item(s).
  * @param  hplay    Pointer to a @ref HAL_PLAY_HandleTypeDef.
  * @param  item     This parameter can be one or a combination of the following values:
  *                  @arg @ref HAL_PLAY_SEC_ITEM_CONFIG
  *                  @arg @ref HAL_PLAY_SEC_ITEM_ALL
  * @param  sec_attr This parameter can be one of the following values:
  *                  @arg @ref HAL_PLAY_SEC
  *                  @arg @ref HAL_PLAY_NSEC
  * @retval HAL_OK    Security attribute has been set successfully.
  * @retval HAL_ERROR Invalid parameter or wrong state.
  */
HAL_StatusTypeDef HAL_PLAY_SetSecAttr(const HAL_PLAY_HandleTypeDef *hplay, uint32_t item,
                                      HAL_PLAY_SecAttrTypeDef sec_attr)
{
  PLAY_TypeDef *p_playx;
  HAL_PLAY_StateTypeDef tmp_state;

  /* Check the parameters */
  if (hplay == NULL)
  {
    return HAL_ERROR;
  }

  p_playx = PLAY_GET_INSTANCE(hplay);

  assert_param(IS_PLAY_ALL_INSTANCE(p_playx));
  assert_param(IS_PLAY_SEC_ITEM(item));
  assert_param(IS_PLAY_ITEM_SEC_ATTR(sec_attr));

  /* Check the peripheral state */
  tmp_state = hplay->State;
  if ((tmp_state != HAL_PLAY_STATE_INIT) && (tmp_state != HAL_PLAY_STATE_READY))
  {
    return HAL_ERROR;
  }

  LL_PLAY_SetSecAttr(p_playx, item, (uint32_t)sec_attr);

  return HAL_OK;
}
#endif /* __ARM_FEATURE_CMSE */

/**
  * @brief  Get the security access level attribute of an item.
  * @param  hplay Pointer to a @ref HAL_PLAY_HandleTypeDef.
  * @param  item  This parameter can be one of the following values:
  *               @arg @ref HAL_PLAY_SEC_ITEM_CONFIG
  *               @arg @ref HAL_PLAY_SEC_ITEM_ALL
  * @note   This function returns @ref HAL_PLAY_NSEC if the handle is NULL.
  * @return The security access level attribute.
  */
HAL_PLAY_SecAttrTypeDef HAL_PLAY_GetSecAttr(const HAL_PLAY_HandleTypeDef *hplay, uint32_t item)
{
  const PLAY_TypeDef *p_playx;

  /* Check the parameters */
  if (hplay == NULL)
  {
    return HAL_PLAY_NSEC;
  }

  p_playx = PLAY_GET_INSTANCE(hplay);

  assert_param(IS_PLAY_ALL_INSTANCE(p_playx));
  assert_param(IS_PLAY_SEC_ITEM(item));

  return ((HAL_PLAY_SecAttrTypeDef)LL_PLAY_GetSecAttr(p_playx, item));
}

/**
  * @brief  Set the privileged access level attribute for item(s).
  * @param  hplay     Pointer to a @ref HAL_PLAY_HandleTypeDef.
  * @param  item      This parameter can be one or a combination of the following values:
  *                   @arg @ref HAL_PLAY_PRIV_ITEM_CONFIG
  *                   @arg @ref HAL_PLAY_PRIV_ITEM_ALL
  * @param  priv_attr This parameter can be one of the following values:
  *                   @arg @ref HAL_PLAY_PRIV
  *                   @arg @ref HAL_PLAY_NPRIV
  * @retval HAL_OK    Privileged attribute has been set successfully.
  * @retval HAL_ERROR Invalid parameter or wrong state.
  */
HAL_StatusTypeDef HAL_PLAY_SetPrivAttr(const HAL_PLAY_HandleTypeDef *hplay, uint32_t item,
                                       HAL_PLAY_PrivAttrTypeDef priv_attr)
{
  PLAY_TypeDef *p_playx;
  HAL_PLAY_StateTypeDef tmp_state;

  /* Check the parameters */
  if (hplay == NULL)
  {
    return HAL_ERROR;
  }

  p_playx = PLAY_GET_INSTANCE(hplay);

  assert_param(IS_PLAY_ALL_INSTANCE(p_playx));
  assert_param(IS_PLAY_PRIV_ITEM(item));
  assert_param(IS_PLAY_ITEM_PRIV_ATTR(priv_attr));

  /* Check the peripheral state */
  tmp_state = hplay->State;
  if ((tmp_state != HAL_PLAY_STATE_INIT) && (tmp_state != HAL_PLAY_STATE_READY))
  {
    return HAL_ERROR;
  }

  LL_PLAY_SetPrivAttr(p_playx, item, (uint32_t)priv_attr);

  return HAL_OK;
}

/**
  * @brief  Get the privileged access level attribute of an item.
  * @param  hplay Pointer to a @ref HAL_PLAY_HandleTypeDef.
  * @param  item  This parameter can be one of the following values:
  *               @arg @ref HAL_PLAY_PRIV_ITEM_CONFIG
  *               @arg @ref HAL_PLAY_PRIV_ITEM_ALL
  * @note   This function returns @ref HAL_PLAY_NPRIV if the handle is NULL.
  * @return The privileged access level attribute.
  */
HAL_PLAY_PrivAttrTypeDef HAL_PLAY_GetPrivAttr(const HAL_PLAY_HandleTypeDef *hplay, uint32_t item)
{
  const PLAY_TypeDef *p_playx;

  /* Check the parameters */
  if (hplay == NULL)
  {
    return HAL_PLAY_NPRIV;
  }

  p_playx = PLAY_GET_INSTANCE(hplay);

  assert_param(IS_PLAY_ALL_INSTANCE(p_playx));
  assert_param(IS_PLAY_PRIV_ITEM(item));

