zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/drivers/src/stm32h5xx_hal_play.c
  return ((HAL_PLAY_PrivAttrTypeDef)LL_PLAY_GetPrivAttr(p_playx, item));
}

/**
  * @}
  */

/**
  * @}
  */

/** @addtogroup PLAY_Private_Functions PLAY Private Functions
  * @{
  */

/**
  * @brief  Configure the Edge Triggers: flag transition of lookup table outputs.
  * @param  hplay      Pointer to a @ref HAL_PLAY_HandleTypeDef.
  * @param  p_config   Pointer to a @ref HAL_PLAY_EdgeTriggerConfTypeDef structure for the Edge Triggers configuration.
  * @param  timeout_ms Timeout duration (in ms).
  * @note   The falling and rising edge configuration is exclusive and thus, a lookup table output cannot be
  *         configured for both rising and falling edges at the same time.
  * @retval HAL_OK      Operation completed successfully.
  * @retval HAL_BUSY    A write is pending.
  * @retval HAL_TIMEOUT Operation timed-out.
  */
static HAL_StatusTypeDef PLAY_LUT_SetEdgeTrigger(const HAL_PLAY_HandleTypeDef *hplay,
                                                 const HAL_PLAY_EdgeTriggerConfTypeDef *p_config,
                                                 uint32_t timeout_ms)
{
  PLAY_TypeDef *p_playx;

  p_playx = PLAY_GET_INSTANCE(hplay);

  /* Check if write access available */
  if (LL_PLAY_LUT_IsEdgeTriggerWriteBusy(p_playx) != 0U)
  {
    return HAL_BUSY;
  }

  /* Update Transition */
  LL_PLAY_LUT_SetEdgeTrigger(p_playx, p_config->lut_out_falling_mask, p_config->lut_out_rising_mask);

  /* Wait until the write is completed */
  /* The Edge Trigger write complete flag cannot be checked here, as it is only available in interrupt mode */
  uint32_t tick_start = HAL_GetTick();
  while (LL_PLAY_LUT_IsEdgeTriggerWriteBusy(p_playx) != 0U)
  {
    if (timeout_ms != HAL_MAX_DELAY)
    {
      if (((HAL_GetTick() - tick_start) > timeout_ms) || (timeout_ms == 0U))
      {
        /* Before returning timeout, re-check if the flag has cleared */
        if (LL_PLAY_LUT_IsEdgeTriggerWriteBusy(p_playx) != 0U)
        {
          return HAL_TIMEOUT;
        }
      }
    }
  }
  return HAL_OK;
}

/**
  * @}
  */

#endif /* PLAY1 */
#endif /* HAL_PLAY_MODULE_ENABLED */

/**
  * @}
  */

/**
  * @}
  */
